Repository: drwhut/tabletop-club
Catalog: assets/.translations/*.po
Languages: eo, es, pt_br

source: Chess Board
eo: Ŝaktabulo
es: Tablero de Ajedrez
pt_br: Tabuleiro de Xadrez

source: An 8x8 Chess board.
eo: Ŝaktabulo 8x8.
es: Un tablero de Ajedrez de 8x8.
pt_br: Tabuleiro 8x8 de Xadrez.

source: Go Board (Large)
eo: Go-tabulo (granda)
es: Tablero Go (Grande)

source: A 19x19 Goban.
eo: Tabulo por goo de 19x19.
es: Un gobán de 19x19.

source: Go Board (Small)
eo: Go-tabulo (malgranda)
es: Tablero Go (Pequeño)

source: A 13x13 and 9x9 Goban.
eo: Tabulo por goo de 13x13 kaj 9x9.
es: Un Goban 13x13 y 9x9.

source: 52-Card Deck
eo: 52-karta ludkartaro
es: Baraja de 52 cartas
pt_br: Baralho de 52 cartas

source: A deck of poker-sized French-suited playing cards excluding jokers.
eo: Kartaro de pokergrandaj francaj ludkartoj, sen ĵokeroj.
es: Una baraja francesa de tamaño para poker excluyendo los comodínes.
pt_br: Baralho de poker com naipes franceses excluindo jokers.

source: Ace of Clubs
eo: Aso trefa
es: As de Tréboles
pt_br: Ás de Paus

source: A poker-sized French-suited playing card.
eo: Pokergranda franca ludkarto.
es: Una carta de baraja de tamaño poker con palo francés.
pt_br: Carta de poker com naipe francês.

source: Ace of Diamonds
eo: Aso karoa
es: As de Diamantes
pt_br: Ás de Ouros

source: Ace of Hearts
eo: Aso kera
es: As de Corazones
pt_br: Ás de Copas

source: Ace of Spades
eo: Aso pika
es: As de Picas
pt_br: Ás de Espadas

source: Eight of Clubs
eo: Oko trefa
es: Ocho de Tréboles
pt_br: Oito de Paus

source: Eight of Diamonds
eo: Oko karoa
es: Ocho de Diamantes
pt_br: Oito de Ouros

source: Eight of Hearts
eo: Oko kera
es: Ocho de corazones
pt_br: Oito de Copas

source: Eight of Spades
eo: Oko pika
es: Ocho de picas
pt_br: Oito de Espadas

source: Five of Clubs
eo: Kvino trefa
es: Cinco de Tréboles
pt_br: Cinco de Paus

source: Five of Diamonds
eo: Kvino karoa
es: Cinco de Diamantes
pt_br: Cinco de Ouros

source: Five of Hearts
eo: Kvino kera
es: Cinco de Corazones
pt_br: Cinco de Copas

source: Five of Spades
eo: Kvino pika
es: Cinco de Picas
pt_br: Cinco de Espadas

source: Four of Clubs
eo: Kvaro trefa
es: Cuatro de Tréboles
pt_br: Quatro de Paus

source: Four of Diamonds
eo: Kvaro karoa
es: Cuatro de Diamantes
pt_br: Quatro de Ouros

source: Four of Hearts
eo: Kvaro kera
es: Cuatro de Corazones
pt_br: Quatro de Copas

source: Four of Spades
eo: Kvaro pika
es: Cuatro de Picas
pt_br: Quatro de Espadas

source: Jack of Clubs
eo: Bubo trefa
es: Jota de Tréboles
pt_br: Valete de Paus

source: Jack of Diamonds
eo: Bubo karoa
es: Jota de Diamantes
pt_br: Valete de Ouros

source: Jack of Hearts
eo: Bubo kera
es: Jota de Corazones
pt_br: Valete de Copas

source: Jack of Spades
eo: Bubo pika
es: Jota de Picas
pt_br: Valete de Espadas

source: Joker Black
eo: Ĵokero nigra
es: Comodín Negro
pt_br: Joker Preto

source: Joker Red
eo: Ĵokero ruĝa
es: Comodín Rojo
pt_br: Joker Vermelho

source: King of Clubs
eo: Reĝo trefa
es: Rey de Tréboles
pt_br: Rei de Paus

source: King of Diamonds
eo: Reĝo karoa
es: Rey de Diamantes
pt_br: Rei de Ouros

source: King of Hearts
eo: Reĝo kera
es: Rey de Corazones
pt_br: Rei de Copas

source: King of Spades
eo: Reĝo pika
es: Rey de Picas
pt_br: Rei de Espadas

source: Nine of Clubs
eo: Naŭo trefa
es: Nueve de Tréboles
pt_br: Nove de Paus

source: Nine of Diamonds
eo: Naŭo karoa
es: Nueve de Diamantes
pt_br: Nove de Ouros

source: Nine of Hearts
eo: Naŭo kera
es: Nueve de Corazones
pt_br: Nove de Copas

source: Nine of Spades
eo: Naŭo pika
es: Nueve de Picas
pt_br: Nove de Espadas

source: Queen of Clubs
eo: Damo trefa
es: Reina de Tréboles
pt_br: Dama de Paus

source: Queen of Diamonds
eo: Damo karoa
es: Reina de Diamantes
pt_br: Dama de Ouros

source: Queen of Hearts
eo: Damo kera
es: Reina de Corazoones
pt_br: Dama de Copas

source: Queen of Spades
eo: Damo pika
es: Reina de Picas
pt_br: Dama de Espadas

source: Seer
eo: Vidanto
es: Vidente

source: Helps villagers by secretly inspecting someone's role every night.
eo: Helpas vilaĝanojn, sekrete kontrolante ies rolon ĉiun nokton.
es: Ayuda a los aldeanos inspeccionando en secreto el papel de alguien todas las noches.

source: Seven of Clubs
eo: Sepo trefa
es: Siete de Tréboles
pt_br: Sete de Paus

source: Seven of Diamonds
eo: Sepo karoa
es: Siete de Diamantes
pt_br: Sete de Ouros

source: Seven of Hearts
eo: Sepo kera
es: Siete de Corazones
pt_br: Sete de Copas

source: Seven of Spades
eo: Sepo pika
es: Siete de Picas
pt_br: Sete de Espadas

source: Six of Clubs
eo: Seso trefa
es: Seis de Tréboles
pt_br: Seis de Paus

source: Six of Diamonds
eo: Seso karoa
es: Seis de Diamantes
pt_br: Seis de Ouros

source: Six of Hearts
eo: Seso kera
es: Seis de Corazones
pt_br: Seis de Copas

source: Six of Spades
eo: Seso pika
es: Seis de Picas
pt_br: Seis de Espadas

source: Ten of Clubs
eo: Deko trefa
es: Diez de Tréboles
pt_br: Dez de Paus

source: Ten of Diamonds
eo: Deko karoa
es: Diez de Diamantes
pt_br: Dez de Ouros

source: Ten of Hearts
eo: Deko kera
es: Diez de Corazones
pt_br: Dez de Copas

source: Ten of Spades
eo: Deko pika
es: Diez de Picas
pt_br: Dez de Espadas

source: Three of Clubs
eo: Trio trefa
es: Tres de Tréboles
pt_br: Três de Paus

source: Three of Diamonds
eo: Trio karoa
es: Tres de Diamantes
pt_br: Três de Ouros

source: Three of Hearts
eo: Trio kera
es: Tres de Corazones
pt_br: Três de Copas

source: Three of Spades
eo: Trio pika
es: Tres de Picas
pt_br: Três de Espadas

source: Two of Clubs
eo: Duo trefa
es: Dos de Tréboles
pt_br: Dois de Paus

source: Two of Diamonds
eo: Duo karoa
es: Dos de Diamantes
pt_br: Dois de Ouros

source: Two of Hearts
eo: Duo kera
es: Dos de Corazones
pt_br: Dois de Copas

source: Two of Spades
eo: Duo pika
es: Dos de Picas
pt_br: Dois de Espadas

source: Villager
eo: Vilaĝano
es: Aldeano

source: Avoid being eaten by werewolves at night by voting against them during the day.
eo: Evitu manĝiĝi de homlupoj en la nokto, balotante kontraŭ ili dum la tago.
es: Evita que te devoren los hombres lobo por la noche votando en su contra durante el día.

source: Werewolf
eo: Homlupo
es: Hombre lobo

source: Decide who to feast upon every night with your pack, avoid suspision from villagers.
eo: Decidu kiun fari festenaĵo ĉiun nokton, evitu suspektiĝi de la vilaĝanoj.
es: Decide a quién dar un festín cada noche con tu manada, evita las sospechas de los aldeanos.

source: Pot
eo: Poto
es: Olla

source: Purse
eo: Sako
es: Bolsa
pt_br: Bolsa

source: Red Cup
eo: Ruĝa taso
es: Taza Roja
pt_br: Copo Vermelho

source: d4 (Black)
eo: d4 (nigra)
es: d4 (Negro)
pt_br: d4 (Preto)

source: A 4-sided die.
eo: 4-edra ĵetpluredro.
es: Un dado de 4 caras.
pt_br: Dado de 4 faces.

source: d4 (Blue)
eo: d4 (blua)
es: d4 (Azul)
pt_br: d4 (Azul)

source: d4 (Brown)
eo: d4 (bruna)
es: d4 (Café)
pt_br: d4 (Marrom)

source: d4 (Cyan)
eo: d4 (bluverda)
pt_br: d4 (Ciano)

source: d4 (Green)
eo: d4 (verda)
es: d4 (Verde)
pt_br: d4 (Verde)

source: d4 (Orange)
eo: d4 (oranĝkolora)
es: d4 (Naranja)
pt_br: d4 (Laranja)

source: d4 (Pink)
eo: d4 (rozkolora)
es: d4 (Rosa)
pt_br: d4 (Rosa)

source: d4 (Purple)
eo: d4 (purpura)
es: d4 (Púrpura)
pt_br: d4 (Roxo)

source: d4 (Red)
eo: d4 (ruĝa)
es: d4 (Rojo)
pt_br: d4 (Vermelho)

source: d4 (White)
eo: d4 (blanka)
es: d4 (Blanco)
pt_br: d4 (Branco)

source: d4 (Yellow)
eo: d4 (flava)
es: d4 (Amarillo)
pt_br: d4 (Amarelo)

source: d6 (Black)
eo: d6 (nigra)
es: d6 (Negro)
pt_br: d6 (Preto)

source: A 6-sided die.
eo: 6-edra ĵetpluredro.
es: Un dado de 6 lados.
pt_br: Dado de 6 faces.

source: d6 (Blue)
eo: d6 (blua)
es: d6 (Azul)
pt_br: d6 (Azul)

source: d6 (Brown)
eo: d6 (bruna)
es: d6 (Café)
pt_br: d6 (Marrom)

source: d6 (Cyan)
eo: d6 (bluverda)
pt_br: d6 (Ciano)

source: d6 (Green)
eo: d6 (verda)
es: d6 (Verde)
pt_br: d6 (Verde)

source: d6 (Orange)
eo: d6 (oranĝkolora)
es: d6 (Naranja)
pt_br: d6 (Laranja)

source: d6 (Pink)
eo: d6 (rozkolora)
es: d6 (Rosa)
pt_br: d6 (Rosa)

source: d6 (Purple)
eo: d6 (purpura)
es: d6 (Púrpura)
pt_br: d6 (Roxo)

source: d6 (Red)
eo: d6 (ruĝa)
es: d6 (Rojo)
pt_br: d6 (Vermelho)

source: d6 (Traditional)
eo: d6 (tradicia)
es: d6 (Tradicional)
pt_br: d6 (Tradicional)

source: d6 (White)
eo: d6 (blanka)
es: d6 (Blanco)
pt_br: d6 (Branco)

source: d6 (Yellow)
eo: d6 (flava)
es: d6 (Amarillo)
pt_br: d6 (Amarelo)

source: d8 (Black)
eo: d8 (nigra)
es: d8 (Negro)
pt_br: d8 (Preto)

source: An 8-sided die.
eo: 8-edra ĵetpluredro.
es: Un dado de 8 lados.
pt_br: Dado de 8 faces.

source: d8 (Blue)
eo: d8 (blua)
es: d8 (Azul)
pt_br: d8 (Azul)

source: d8 (Brown)
eo: d8 (bruna)
es: d8 (Café)
pt_br: d8 (Marrom)

source: d8 (Cyan)
eo: d8 (bluverda)
pt_br: d8 (Ciano)

source: d8 (Green)
eo: d8 (verda)
es: d8 (Verde)
pt_br: d8 (Verde)

source: d8 (Orange)
eo: d8 (oranĝkolora)
es: d8 (Naranja)
pt_br: d8 (Laranja)

source: d8 (Pink)
eo: d8 (rozkolora)
es: d8 (Rosa)
pt_br: d8 (Rosa)

source: d8 (Purple)
eo: d8 (purpura)
es: d8 (Púrpura)
pt_br: d8 (Roxo)

source: d8 (Red)
eo: d8 (ruĝa)
es: d8 (Rojo)
pt_br: d8 (Vermelho)

source: d8 (White)
eo: d8 (blanka)
es: d8 (Blanco)
pt_br: d8 (Branco)

source: d8 (Yellow)
eo: d8 (flava)
es: d8 (Amarillo)
pt_br: d8 (Amarelo)

source: d10 (Black)
eo: d10 (nigra)
es: d10 (Negro)
pt_br: d10 (Preto)

source: A 10-sided die.
eo: 10-edra ĵetpluredro.
es: Un dado de 10 lados.
pt_br: Dado de 10 faces.

source: d10 (Blue)
eo: d10 (blua)
es: d10 (Azul)
pt_br: d10 (Azul)

source: d10 (Brown)
eo: d10 (bruna)
es: d10 (Café)
pt_br: d10 (Marrom)

source: d10 (Cyan)
eo: d10 (bluverda)
es: d10 (Cian)
pt_br: d10 (Ciano)

source: d10 (Green)
eo: d10 (verda)
es: d10 (Verde)
pt_br: d10 (Verde)

source: d10 (Orange)
eo: d10 (oranĝkolora)
es: d10 (Naranja)
pt_br: d10 (Laranja)

source: d10 (Percent) (Black)
eo: d10 (procentoj) (nigra)
es: d10 (Porcentaje) (Negro)
pt_br: d10 (Porcento) (Preto)

source: d10 (Percent) (Blue)
eo: d10 (procentoj) (blua)
es: d10 (Porcentaje) (Azul)
pt_br: d10 (Porcento) (Azul)

source: d10 (Percent) (Brown)
eo: d10 (procentoj) (bruna)
es: d10 (Porcentaje) (Café)
pt_br: d10 (Porcento) (Marrom)

source: d10 (Percent) (Cyan)
eo: d10 (procentoj) (bluverda)
es: d10 (Porcentaje) (Cian)
pt_br: d10 (Porcento) (Ciano)

source: d10 (Percent) (Green)
eo: d10 (procentoj) (verda)
es: d10 (Porcentaje) (Verde)
pt_br: d10 (Porcento) (Verde)

source: d10 (Percent) (Orange)
eo: d10 (procentoj) (oranĝkolora)
es: d10 (Porcentaje) (Naranja)
pt_br: d10 (Porcento) (Laranja)

source: d10 (Percent) (Pink)
eo: d10 (procentoj) (rozkolora)
es: d10 (Porcentaje) (Rosa)
pt_br: d10 (Porcento) (Rosa)

source: d10 (Percent) (Purple)
eo: d10 (procentoj) (purpura)
es: d10 (Porcentaje) (Púrpura)
pt_br: d10 (Porcento) (Roxo)

source: d10 (Percent) (Red)
eo: d10 (procentoj) (ruĝa)
es: d10 (Porcentaje) (Rojo)
pt_br: d10 (Porcento) (Vermelho)

source: d10 (Percent) (White)
eo: d10 (procentoj) (blanka)
es: d10 (Porcentaje) (Blanco)
pt_br: d10 (Porcento) (Branco)

source: d10 (Percent) (Yellow)
eo: d10 (procentoj) (flava)
es: d10 (Porcentaje) (Amarillo)
pt_br: d10 (Porcento) (Amarelo)

source: d10 (Pink)
eo: d10 (rozkolora)
es: d10 (Rosa)
pt_br: d10 (Rosa)

source: d10 (Purple)
eo: d10 (purpura)
es: d10 (Púrpura)
pt_br: d10 (Roxo)

source: d10 (Red)
eo: d10 (ruĝa)
es: d10 (Rojo)
pt_br: d10 (Vermelho)

source: d10 (White)
eo: d10 (blanka)
es: d10 (Blanco)
pt_br: d10 (Branco)

source: d10 (Yellow)
eo: d10 (flava)
es: d10 (Amarillo)
pt_br: d10 (Amarelo)

source: d12 (Black)
eo: d12 (nigra)
es: d12 (Negro)
pt_br: d12 (Preto)

source: A 12-sided die.
eo: 12-edra ĵetpluredro.
es: Un dado de 12 lados.
pt_br: Dado de 12 faces.

source: d12 (Blue)
eo: d12 (blua)
es: d12 (Azul)
pt_br: d12 (Azul)

source: d12 (Brown)
eo: d12 (bruna)
es: d12 (Café)
pt_br: d12 (Marrom)

source: d12 (Cyan)
eo: d12 (bluverda)
es: d12 (Cian)
pt_br: d12 (Ciano)

source: d12 (Green)
eo: d12 (verda)
es: d12 (Verde)
pt_br: d12 (Roxo)

source: d12 (Orange)
eo: d12 (oranĝkolora)
es: d12 (Naranja)
pt_br: d12 (Laranja)

source: d12 (Pink)
eo: d12 (rozkolora)
es: d12 (Rosa)
pt_br: d12 (Rosa)

source: d12 (Purple)
eo: d12 (purpura)
es: d12 (Púrpura)
pt_br: d12 (Roxo)

source: d12 (Red)
eo: d12 (ruĝa)
es: d12 (Rojo)
pt_br: d12 (Vermelho)

source: d12 (White)
eo: d12 (blanka)
es: d12 (Blanco)
pt_br: d12 (Branco)

source: d12 (Yellow)
eo: d12 (flava)
es: d12 (Amarillo)
pt_br: d12 (Amarelo)

source: d20 (Black)
eo: d20 (nigra)
es: d20 (Negro)
pt_br: d20 (Preto)

source: A 20-sided die.
eo: 20-edra ĵetpluredro.
es: Un dado de 20 lados.
pt_br: Dado de 20 faces.

source: d20 (Blue)
eo: d20 (blua)
es: d20 (Azul)
pt_br: d20 (Azul)

source: d20 (Brown)
eo: d20 (bruna)
es: d20 (Café)
pt_br: d20 (Marrom)

source: d20 (Cyan)
eo: d20 (bluverda)
es: d20 (Cian)
pt_br: d20 (Ciano)

source: d20 (Green)
eo: d20 (verda)
es: d20 (Verde)
pt_br: d20 (Verde)

source: d20 (Orange)
eo: d20 (oranĝkolora)
es: d20 (Naranja)
pt_br: d20 (Laranja)

source: d20 (Pink)
eo: d20 (rozkolora)
es: d20 (Rosa)
pt_br: d20 (Rosa)

source: d20 (Purple)
eo: d20 (purpura)
es: d20 (Púrpura)
pt_br: d20 (Roxo)

source: d20 (Red)
eo: d20 (ruĝa)
es: d20 (Rojo)
pt_br: d20 (Vermelho)

source: d20 (White)
eo: d20 (blanka)
es: d20 (Blanco)
pt_br: d20 (Branco)

source: d20 (Yellow)
eo: d20 (flava)
es: d20 (Amarillo)
pt_br: d20 (Amarelo)

source: Chess
eo: Ŝako
es: Ajedrez
pt_br: Xadrez

source: Standard Chess for two players.
eo: Norma ŝako por du ludantoj.
es: Ajedrez Reglamentario para 2 jugadores.
pt_br: Xadrez padrão para dois jogadores.

source: Dominoes
eo: Domenoŝtonoj
es: Dominó

source: A bag with 28 tiles has been provided.
eo: Sako da 28 kaheloj estas provizita.
es: Se ha proporcionado una bolsa con 28 fichas.

source: Go
eo: Goo

source: Standard Go for two players. Can play on a 19x19, 13x13, or 9x9 board.
eo: Norma goo por du ludantoj. Eblas ludi sur tabulo de 19x19, 13x13 aŭ 9x9.
es: Go estándar para dos jugadores. Puede jugar en un tablero de 19x19, 13x13 o 9x9.

source: Poker
eo: Pokero
es: Póker

source: Each player has been given 25 chips, which sum up to a value of 500.
eo: Ĉiu ludanto ricevas 25 ĵetonojn, en sumo de 500.
es: A cada jugador se le han dado 25 fichas, las cuales suman un valor de 500.
pt_br: Cada jogador recebeu 25 fichas, que somam ao valor de 500.

source: Light and airy, this piece is guaranteed not to steal focus.
eo: Malpeza kaj maldensa, tiu ĉi peco garantiite ne deturnos la atenton.
es: Ligera y etérea, esta pieza está garantizada que no se robara la atención.
pt_br: Leve e arejada, essa peça é garantida em não tirar o foco.

source: This is cool. You can walk into a dinner party, grab a glass of prosecco, kiss the host, then casually defuse a large bomb one second before the timer runs out. That level of cool. Maybe you're not that cool, but if you adopt this as your personal theme tune, people will THINK you're that cool.
eo: Ĉi tiu mojosas. Vi povus promeni en festenon, preni glason da Proseka vino, kisi la gastiganton, kaj tiam senprajmigi bombegon senemfaze kun unu sekundo ĉe la horloĝo. Tia nivelo de mojoseco. Eble vi ne tiel mojosas, sed se vi adoptas tiun ĉi kiel vian personan distingan melodion, oni PENSOS, ke vi tiel mojosas.
es: Esta está bien chévere. Podrás llegar a una fiesta, tomar tu copa de prosecco, besar al anfitrión, y después tranquilamente desactivar una bomba justo un segundo antes de que acabe el conteo. Así de chévere. Tal vez tu no seas tan chévere, pero si adoptas este como tu tema personal, la gente PENSARA que si lo eres.
pt_br: Isso é legal. Você pode entrar em uma festa de jantar, pegar uma copo de prosecco, beijar o anfitrião, e então casualmente desarmar um grande bomba um segundo antes de o cronômetro acabar. Legal a esse nível. Talvez você não seja tão legal assim, mas se você adotar isso como a sua música tema pessoal, as pessoas vão ACHAR que você é tão legal assim.

source: Oh hello. I didn't see you there. Welcome to my pad. My favorite parts are the view of the beach, and this very groovy orange shag-carpeting on the walls. I still haven't been able to teach my Roombas to get up by the ceiling, though.
eo: Ho, saluton. Mi ne vidis vin. Bonvenon al mia humila loĝejo. Miaj plej ŝatataj partoj estas la elvido al la plaĝo, kaj tiu ĉi tre mojoseta oranĝkolora longafibra tapiŝo sur la muroj. Ankoraŭ mi ne povis instrui al miaj robotaj pulvosuĉiloj grimpi al la plafono, tamen.
es: Hola, no te había visto allí. Bienvenido a mi guarida. Mis partes favoritas son la vista de la playa, y el alfombrado naranja sensacional que tiene sobre las paredes. Sin embargo, aún no he logrado enseñar a mis Rumbas para que aspiren el techo.
pt_br: Ah, olá. Eu não vi você aí. Bem-vindo à minha casa. Minhas partes favoritas são a vista para a praia, e esse carpete felpudo laranja irado nas paredes. Apesar de que eu ainda não ensinei os meu Roombas a limpar o teto.

source: Jazzy! Gumshoe-y! Mystery-y! I suck at making adjectives. Who needs adjectives anyway! I'm fine without adjectives. How fine without adjectives, you may ask? I can't say - as that would require some sort of descriptor! And I don't need descriptors in my writings... Maybe one... tiny little... NO! What am I thinking!? I refuse! I've completely had it with adjectives! Hah! Adverbs work perfectly fine! Woohoo! Adverbs! And before I get mail... adjectives killed my family, so I can go off on them all I want.
eo: Ĵaza! Detektiveca! Mistereca! Ho, lacas mi pri adjektivoj. Al kiu necesas adjektivoj, ĉiuokaze?! Mi tute enordas sen adjektivoj. Kiom enorde, vi eble demandas? Mi ne povas diri - ĉar tio necesigus ian specon de priskribilo! Kaj mi ne bezonas priskribilojn en miaj skribaĵoj... Eble unu... eta, malgranda... NE! Kion mi pensas?! Mi rifuzas! Tute ne utilas al mi adjektivoj! Ĥa! Adverboj tute bone funkcias! Jes ja! Adverboj! Kaj antaŭ ol mi ricevas leterojn... adjektivoj mortigis mian familion, do mi tutrajtas ilin mallaŭdi.
es: ¡Jazzístico! ¡Detectivesco! ¡Mistérico! Los adjetivos no se me dan. ¡Y para qué necesitamos adjetivos! Estoy bien sin los adjetivos. ¿Qué tan bien puedo estar sin ellos, podrás preguntar? ¡No lo puedo decir, ya que ello requeriría algún tipo de descripción! Y no necesito descripciones en mis escritos... Tal vez solo una... pequeñita... ¡No! ¿En qué estaba pensando? ¡Me niego! ¡Ya estoy harto de los adjetivos! ¡Los adverbios funcionan perfectamente bien! ¡Hurra! ¡Adverbios! Y antes de recibir un montón de correos... los adjetivos asesinaron a mi familia, por lo que puedo enemistarme con ellos cuanto yo quiera.
pt_br: Jazzístico! Detetivíssimo! Misteriosíssimo! Sou horrível em criar adjetivos. De qualquer forma, quem precisa de adjetivos! Estou bem sem adjetivos. Você pergunta o quão bem eu estou sem adjetivos? Não posso dizer - porque isso precisaria de algum tipo de descritor! E não preciso de descritores em minha escrita... Talvez um... pouquinho... NÃO! O que estou pensando? Eu me recuso! Eu já estou cheio de adjetivos! Ahah! Advérbios funcionam perfeitamente bem! Woohoo! Advérbios! E antes de eu receber cartas... adjetivos mataram a minha família, então eu posso falar mal deles o quanto eu quiser.

source: Nice little non-offending light jazz piece for vibes.
eo: Boneta, senofenda kaj malpeza ĵaz-peco por bonaj sentoj.
es: Linda y pequeña pieza de Jazz inofensiva para la vibra.
pt_br: Pequena inofensiva peça de jazz leve para vibes.

source: You're looking for the low-down, huh? That's going to take lettuce. You want the dope? the scoop? the skinny? Ten bucks a day plus expenses. No negotiations. I ain't no fourth-rate gumshoe - but a ducky shincracker like you already knew that... Out of curiosity, what's the word for people who overuse slang?
eo: Vi serĉas la detalojn, he? Por tio kostos ja. Ĉu volas vi l' informojn, detalojn, ĉion ĉi? Dek spesojn por tago plus elspezoj. Sennegoce. Kvararanga detektivulo mi ne estas - sed anasa krurokrakanto kiel vi jam tion sciis... parenteze, ĉu vi scias, kion signifas "anasa krurokrakanto"? Ĉar mi ne.
es: Buscas la neta? Eso va arequerir lana. Quieres saber cual es la onda? El chisme? De lavadero? Van a ser diez bolas al día más los gastos. No es negociable. No soy un soplón de cuarta, pero un malandro trucha como tú ya lo sabía, que no?... Por curiosidad, como se le llama a las personas que hacen uso exagerado del caló?
pt_br: Você tá procurando pelos detalhes, hein? Isso vai precisar de verdinhas. Você quer a boa? O babado? A nova? Dez pratas por dia mais custos adicionais. Sem negociação. Não sou nenhum detetive de quarta categoria - mas um patinho quebra-canela como você já sabia disso... Por curiosidade, qual é a palavra pra pessoas que usam gírias demais mesmo?

source: A piece of music from a more elegant time, 1940. This is a beautiful slow piece that will make you want to pick up some champagne and go off slow dancing with people... or penguins. I like penguins. And now some searchable words: Big Band. 1940s. Forties. Formal Party. Penguin Slow Dance. No Whammies.
eo: Muzika peco de pli eleganta tempo, 1940. Tiu ĉi estas bela, malrapida peco kiu voligos vin preni iom da ĉampano kaj iri malrapide danci kun homoj... aŭ pingvenoj. Mi ŝatas pingvenojn. Kaj nun kelkaj serĉeblaj vortoj: Granda ĵazbando. 1940-aj jaroj. Formala kuniĝo. Pingvena malrapida danco. Sen trompaĵoj.
es: Una pieza musical de un tiempo más elegante, 1940. Esta es una bella y lenta pieza que te hará desear servirte una copa de Champán y bailar despacio con las personas... o con pingüinos. Me gustan los pingüinos. Y ahora algunas palabras para búsqueda: Big Band. 1940s. Cuarentas. Fiesta formal. Baile lento con pingüinos. Sin agolparse.
pt_br: Um pedaço de música de uma época elegante, 1940. Isto é uma linda peça lenta que vai te fazer querer pegar um pouco de champanhe a se ir dançar lentamente com algumas pessoas... ou pinguins. Eu gosto de pinguins. E agora, algumas palavras pesquisáveis: Banda Grande. Anos 40. Quarentas. Festa Formal. Dança Lenta de Pinguins. Sem Truques.

source: Welcome to the lobby of the FUTURE! Luxurious automatic ashtrays, and modern green vinyl furnishings set off the shag carpeted walls. Enjoy a Rusty Nail from our cheerful bar staff (with a complimentary cheese and fruit plate before 5pm). We feature prime rib dinners every day that ends in a "y"! Remember to tip the bellhops at least 5 cents per bag. Enjoy your stay! This was written 2 years before it was published, because I didn't have a good enough upright bass sample to make it go.
eo: Bonvenon al la vestiblo de la ESTONTECO! Luksaj aŭtomataj cindrujoj, kaj modernaj verdaj vinilaj mebloj, kiuj prilumas la longfibra-tapiŝajn murojn. Ĝuu glason da viskio en nia trinkejo (kun senpaga plado de fromaĝo kaj frukto antaŭ 17:00). Ni prezentas ripaĵajn vespermanĝojn ĉiun tagon, kiu finiĝas per "o"! Memoru gratifiki la grumojn per almenaŭ 5 cendojn por ĉiu sako. Ĝuu la gastloĝon! Ĉi tio estis skribita 2 jarojn antaŭ ĝia eldono, ĉar mi ne havis sufiĉe bonan sonpecon de kontrabaso por fari ĝin.
es: ¡Bienvenido al lobby del futuro! Lujosos ceniceros automáticos, y decoración moderna de vinilo verde acentúan las paredes alfombradas. Disfrute un clavo oxidado de nuestro alegre personal del bar (con un platillo de quesos y fruta de cortesía antes de las 5 pm). Ofrecemos cenas con finos cortes todos los días. Recuerde dar propina a los botones al menos 5 céntimos por maleta. Disfrute de su estancia. Esto lo escribí 2 años antes de publicarlo, porque no tenía una muestra de bajo vertical, lo bastante buena para hacerlo.

source: Sad and smooth; Think 1950's detective film.
eo: Malgaja kaj glata, kvazaŭ de detektiva filmo de la 1950-aj jaroj.
es: Triste y suave. Piense en una película de detectives de los años 50.
pt_br: Triste e suave; Imagine filme de detetive dos anos 50.
