Repository: drwhut/tabletop-club
Catalog: assets/.translations/*.po
Languages: eo, es, pt_br

source: Sort of a minor mid-tempo jazz combo with 2 pianos. Melody is doubled in octaves. Soloist goes outside more than the guy comping... but hey - what are soloists for?
eo: Ia speco de minora mezrapida ĵazgrupeto kun du pianoj. La melodio estas duobligita en oktavoj. La solisto iras eksteren pli ol la akompananto... sed hej - ĉu ne solistoj ekzistas por tio?
es: Es como un combo de Jazz de medio tiempo con 2 pianos. La melodía se dobla en las octavas. ¿El solista se sale más que el tipo que acompaña... pero para qué son los solistas?

source: This one got turned up to 11. I started producing this as a parody... then I really started liking it, so I guess it is a pastiche now? Oh, man... I wish there was an allowance for pastiche in copyright like there is for parody.
eo: Tiu ĉi trograndiĝis. Mi ekproduktis ĝin kiel parodion... tiam mi vere ekŝategis ĝin, do mi supozas, ke nun ĝi estas pastiĉo? Ho, ve... mi tre volas, ke estus permeso por pastiĉoj en kopirajto, kiel estas por parodioj.
es: Estas se va hasta el 11. Comencé a producirla como una parodia... y comenzó a gustarme, por lo que creo que ahora es una mezcla, no? Válgame... quisiera que hubiera licencia para las mezclas en los derechos de autor como la hay con las parodias.
pt_br: Essa foi aumentada demais. Eu comecei produzindo como uma paródia... então eu realmente comecei a gostar dela, então acho que agora ela é uma pastiche? Ah, cara... Eu queria que existisse uma permissão de pastiche pra direitos autorais como tem pra paródia.

source: The year is... I have no idea. Timeless. Could be now, could be in the 1950s. Super cool jazz for your hardcore detectives! Also useful for beat poets! Also useful for ennui or boredom! Well, interesting sorts of boredom.
eo: La jaro estas... mi tute ne scias. Ĝi estas sentempa. Povus esti nun, aŭ povus esti la 1950-aj jaroj. Mojosega ĵazo por viaj superaj detektivoj! Ankaŭ ĝi utilas por beat-poetoj, aŭ por enuo! Nu, interesaj specoj de enuo.
es: El año es... ni idea. Sin tiempo. Podría ser ahora, podrían ser los años 50. Jazz muy en onda para sus rudos detectives! También es útil para los poetas del beat! ¡También es útil para los ratos aburridos! Bueno, aburridos pero interesantes.
pt_br: O ano é... não faço a mínima idéia. Sem época. Poderia ser agora, poderia ser nos anos 50. Jazz super legal pra seus detetives hardcore! Útil também para poetas beat! Também útil para o tédio ou cansaço existencial! Bem, interessantes tipos de tédio.

source: Bishop Black
eo: Kuriero nigra
es: Alfil Negro
pt_br: Bispo Preto

source: Bishop White
eo: Kuriero blanka
es: Alfil Blanco
pt_br: Bispo Branco

source: King Black
eo: Reĝo nigra
es: Rey Negro
pt_br: Rei Preto

source: King White
eo: Reĝo blanka
es: Rey Blanco
pt_br: Rei Branco

source: Knight Black
eo: Ĉevalo nigra
es: Caballo Negro
pt_br: Cavalo Preto

source: Knight White
eo: Ĉevalo blanka
es: Caballo Blanco
pt_br: Cavalo Branco

source: Pawn Black
eo: Peono nigra
es: Peón Negro
pt_br: Peão Preto

source: Pawn White
eo: Peono blanka
es: Peón Blanco
pt_br: Peão Branco

source: Queen Black
eo: Damo nigra
es: Reina Negra
pt_br: Rainha Preta

source: Queen White
eo: Damo blanka
es: Reina Blanca
pt_br: Rainha Branca

source: Rook Black
eo: Turo nigra
es: Torre Negra
pt_br: Torre Preta

source: Rook White
eo: Turo blanka
es: Torre Blanca
pt_br: Torre Branca

source: Stone Black
eo: Ŝtono nigra
es: Piedra negra

source: Stone White
eo: Ŝtono blanka
es: Piedra Blanca

source: Clouds
eo: Nuboj
es: Nubes
pt_br: Nuvens

source: Dallas West
eo: Dallas-okcidento
es: Dallas Oeste
pt_br: Oeste Dallas

source: Forest
eo: Arbaro
es: Bosque
pt_br: Floresta

source: Ice River
eo: Glacia rivero
es: Rio de Hielo
pt_br: Rio de Gelo

source: Nebula
eo: Nebulozo
pt_br: Nébula

source: Niagra Falls
eo: Niagaraj Akvofaloj
es: Cataratas del Niágara
pt_br: Cataratas do Niágara

source: Park
eo: Parko
es: Parque
pt_br: Parque

source: Park Winter
eo: Parko en vintro
es: Invierno en el Parque
pt_br: Parque Inverno

source: Path
eo: Irvojeto
es: Camino
pt_br: Caminho

source: Space
eo: Kosmo
es: Espacio
pt_br: Espaço

source: Alarm
eo: Alarmo
es: Alarma
pt_br: Alarme

source: An alarm for alarming situations.
eo: Alarmo por alarmaj situacioj.
es: Una alarma para situaciones alarmantes.
pt_br: Um alarme para situações alarmantes.

source: Gramophone
eo: Gramofono
es: Gramófono
pt_br: Gramofone

source: A low-poly vintage gramophone.
eo: Antikva gramofono kun malmultaj pluranguloj.
es: Un gramófono vintage de pocos polígonos.
pt_br: Um gramofone vintage com poucos polígonos.

source: Picnic Bench
eo: Piknika benko
es: Banca de Picnic
pt_br: Banco de piquenique

source: Table
eo: Tablo
es: Mesa
pt_br: Mesa

source: Blank Page
eo: Blanka paĝo
es: Página en blanco

source: There's nothing here...
eo: Estas nenio ĉi tie...
es: No hay nada aquí...

source: Score Card
eo: Poentara karto
es: Tarjeta de puntuación

source: A generic score card for up to 10 players.
eo: Ĝenerala poentara karto por ĝis 10 ludantoj.
es: Una tarjeta de puntuación genérica para hasta 10 jugadores.

source: Radio
eo: Radioricevilo
pt_br: Rádio

source: An old radio from a bygone era.
eo: Malnova radioricevilo de pasinta epoko.
es: Un radio antiguo de una era pasada.
pt_br: Um velho rádio de uma era passada.

source: Blue
eo: Blua
es: Azul

source: A blue token.
eo: Blua ĵetono.
es: Un jetón azul.

source: Brown
eo: Bruna
es: Café

source: A brown token.
eo: Bruna ĵetono.
es: Un jetón cafe.

source: Cyan
eo: Bluverda
es: Cian

source: A cyan token.
eo: Bluverda ĵetono.
es: Un jetón cian.

source: Domino 0-0
eo: Domenoŝtono 0-0

source: Domino 0-1
eo: Domenoŝtono 0-1
es: Dominó 0-1

source: Domino 0-2
eo: Domenoŝtono 0-2
es: Dominó 0-2

source: Domino 0-3
eo: Domenoŝtono 0-3
es: Dominó 0-3

source: Domino 0-4
eo: Domenoŝtono 0-4
es: Dominó 0-4

source: Domino 0-5
eo: Domenoŝtono 0-5
es: Dominó 0-5

source: Domino 0-6
eo: Domenoŝtono 0-6
es: Dominó 0-6

source: Domino 1-1
eo: Domenoŝtono 1-1
es: Dominó 1-1

source: Domino 1-2
eo: Domenoŝtono 1-2
es: Dominó 1-2

source: Domino 1-3
eo: Domenoŝtono 1-3
es: Dominó 1-3

source: Domino 1-4
eo: Domenoŝtono 1-4
es: Dominó 1-4

source: Domino 1-5
eo: Domenoŝtono 1-5
es: Dominó 1-5

source: Domino 1-6
eo: Domenoŝtono 1-6
es: Dominó 1-6

source: Domino 2-2
eo: Domenoŝtono 2-2
es: Dominó 2-2

source: Domino 2-3
eo: Domenoŝtono 2-3
es: Dominó 2-3

source: Domino 2-4
eo: Domenoŝtono 2-4
es: Dominó 2-4

source: Domino 2-5
eo: Domenoŝtono 2-5
es: Dominó 2-5

source: Domino 2-6
eo: Domenoŝtono 2-6
es: Dominó 2-6

source: Domino 3-3
eo: Domenoŝtono 3-3
es: Dominó 3-3

source: Domino 3-4
eo: Domenoŝtono 3-4
es: Dominó 3-4

source: Domino 3-5
eo: Domenoŝtono 3-5
es: Dominó 3-5

source: Domino 3-6
eo: Domenoŝtono 3-6
es: Dominó 3-6

source: Domino 4-4
eo: Domenoŝtono 4-4
es: Dominó 4-4

source: Domino 4-5
eo: Domenoŝtono 4-5
es: Dominó 4-5

source: Domino 4-6
eo: Domenoŝtono 4-6
es: Dominó 4-6

source: Domino 5-5
eo: Domenoŝtono 5-5
es: Dominó 5-5

source: Domino 5-6
eo: Domenoŝtono 5-6
es: Dominó 5-6

source: Domino 6-6
eo: Domenoŝtono 6-6
es: Dominó 6-6

source: Green
eo: Verda
es: Verde

source: A green token.
eo: Verda ĵetono.
es: Un jetón verde.

source: Orange
eo: Oranĝkolora
es: Naranja

source: An orange token.
eo: Oranĝkolora ĵetono.
es: Un jetón naranja.

source: Pink
eo: Rozkolora
es: Rosa

source: A pink token.
eo: Rozkolora ĵetono.
es: Un jetón rosa.

source: Purple
eo: Purpura
es: Púrpura

source: A purple token.
eo: Purpura ĵetono.
es: Un jetón púrpura.

source: Red
eo: Ruĝa
es: Rojo

source: A red token.
eo: Ruĝa ĵetono.
es: Un jetón rojo.

source: White
eo: Blanka
es: Blanco

source: A white token.
eo: Blanka ĵetono.
es: Un jetón blanco.

source: Yellow
eo: Flava
es: Amarillo

source: A yellow token.
eo: Flava ĵetono.
es: Un jetón amarillo.

source: A poker chip.
eo: Pokera ĵetono.
es: Una ficha de póker.
pt_br: Uma ficha de poker.

source: 20 x 1 Chips
eo: 20 x 1-ĵetonoj
es: 20 x 1 Fichas
pt_br: 20 x fichas de 1

source: A stack of 20 1-value chips.
eo: Stako da 20 1-valoraj ĵetonoj.
es: Una pila de 20 fichas de valor 1.
pt_br: Uma pilha de 20 fichas com valor de 1.

source: 20 x 10 Chips
eo: 20 x 10-ĵetonoj
es: 20 Fichas de 10
pt_br: 20 x fichas de 10

source: A stack of 20 10-value chips.
eo: Stako da 20 10-valoraj ĵetonoj.
es: Una pila de 20 fichas de valor 10.
pt_br: Uma pilha de 20 fica com valor de 10.

source: 20 x 100 Chips
eo: 20 x 100-ĵetonoj
es: 20 Fichas de 100
pt_br: 20 x fichas de 100

source: A stack of 20 100-value chips.
eo: Stako da 20 100-valoraj ĵetonoj.
es: Una pila de 20 fichas de valor 100.
pt_br: Uma pilha de 20 fichas com valor de 100.

source: 20 x 25 Chips
eo: 20 x 25-ĵetonoj
es: 20 Fichas de 25
pt_br: 20 x fichas de 25

source: A stack of 20 25-value chips.
eo: Stako da 20 25-valoraj ĵetonoj.
es: Una pila de 20 fichas de valor 25.
pt_br: Uma pilha de 20 fichas com valor de 25.

source: 20 x 5 Chips
eo: 20 x 5-ĵetonoj
es: 20 Fichas de 5
pt_br: 20 x fichas de 5

source: A stack of 20 5-value chips.
eo: Stako da 20 5-valoraj ĵetonoj.
es: Una pila de 20 fichas de valor 5.
pt_br: Uma pilha de 20 fichas com valor de 5.

source: Lobby Time - Kevin MacLeod
es: Tiempo de lobby - Kevin MacLeod

source: Welcome to the lobby of the FUTURE! Luxurious automatic ashtrays, and modern green vinyl furnishings set off the shag carpeted walls. Enjoy a Rusty Nail from our cheerful bar staff (with a complimentary cheese and fruit plate before 5pm). We feature prime rib dinners every day that ends in a
pt_br: Bem-vindo ao salão do FUTURO! Cinzeiros luxuosos automáticos, e modernos móveis de vinil verde que destacam as paredes de carpete felpudo. Aproveite um “Rusty Nail” da nossa alegre equipe do bar (com um prato de queijo e frutas complementar antes das 17:00). Nós contamos com jantares de costela nobre todos os dias que terminam em uma

source: Marriott Madison West
pt_br: Oeste Marriot Madison
