Repository: drwhut/tabletop-club
Catalog: game/Translations/*.po
Languages: de

source: Host has disconnected from the room.
de: Host hat die Verbindung zum Raum getrennt.

source: Only the host can seal the room.
de: Nur der Host kann den Raum verschließen.

source: Too many rooms are open.
de: Es sind zu viele Räume offen.

source: Already in a room.
de: Schon in einem Raum.

source: Room does not exist.
de: Raum existiert nicht.

source: Room is sealed.
de: Raum ist verschlossen.

source: Message format is invalid.
de: Nachrichtenformat ist ungültig.

source: Message is invalid when not in a room.
de: Nachricht ist ungültig, solange nicht in einem Raum.

source: Internal server error.
de: Interner Server-Fehler.

source: Invalid destination.
de: Ungültiges Ziel.

source: Invalid command.
de: Ungültiger Befehl.

source: Too many players connected.
de: Zu viele Spieler*innen verbunden.

source: Transfer mode is invalid.
de: Übertragungsmodus ist ungültig.

source: Too many connections.
de: Zu viele Verbindungen.

source: Reconnected too quickly.
de: Zu schnelle Wiederverbindung.

source: Too much text being sent, waiting...
de: Chat-Nachricht zu lang, warte...

source: Room Code: [b]%s[/b]
de: Raum-Code: [b]%s[/b]

source: Hide Room Code
de: Raum-Code verstecken

source: Show Room Code
de: Raum-Code anzeigen

source: %s has joined the game.
de: %s ist dem Spiel beigetreten.

source: %s changed their name to %s
de: %s änderte seinen*ihren Namen zu %s

source: %s has left the game.
de: %s hat das Spiel verlassen.

source: Contents of %s
de: Inhalt von %s

source: %s is empty.
de: %s is leer.

source: No objects have been selected.
de: Keine Objekte wurden ausgewählt.

source: A stack of %d cards.
de: Ein Stapel von %d Karten.

source: A stack of %d tokens.
de: Ein Stapel von %d Spielsteinen.

source: No description.
de: Keine Beschreibung.

source: Author: %s
de: Autor: %s

source: License: %s
de: Lizenz: %s

source: Modified by: %s
de: Geändert durch: %s

source: A total of %d objects were selected:
de: Insgesamt wurden %d Objekte ausgewählt:

source: Stack of %d cards
de: Stapel von %d Karten

source: Stack of %d tokens
de: Stapel von %d Spielsteinen

source: You can use this notebook to write down information that will persist between sessions.
de: Du kannst dieses Notizbuch verwenden, um Informationen zu notieren, die zwischen den Sitzungen erhalten bleiben sollen.

source: Are you sure you want to delete the page '%s'?
de: Soll die Seite '%s' wirklich gelöscht werden?

source: Modified: %s
de: Modifiziert: %s

source: Save a file
de: Eine Datei speichern

source: Save
de: Speichern

source: Load
de: Laden

source: Sort:
de: Sortieren:

source: Last Modified
de: Zuletzt verändert

source: Delete file?
de: Datei Löschen?

source: Overwrite file?
de: Datei überschreiben?

source: Rename
de: Umbenennen

source: Duplicate
de: Duplizieren

source: Invalid name!
de: Ungültiger Name!

source: File names cannot contain any of the following characters: %s
de: Dateinamen können keine der folgenden Zeichen enthalten: %s

source: Rename file...
de: Datei umbenennen…

source: Please enter a new name for the file:
de: Bitte einen Namen für die Datei eingeben:

source: Are you sure you want to delete '%s'?
de: Soll „%s“ wirklich gelöscht werden?

source: The file '%s' already exists. Are you sure you want to overwrite it?
de: Die Datei „%s“ existiert bereits. Wirklich überschreiben?

source: Page %d/%d
de: Seite %d %d

source: All
de: Alle

source: Boards
de: Bretter

source: Cards
de: Karten

source: Containers
de: Container

source: Dice
de: Würfel

source: Music
de: Musik

source: Pieces
de: Spielsteine

source: Skyboxes
de: Skyboxen

source: Sounds
de: Geräusche

source: Speakers
de: Lautsprecher

source: Stacks
de: Stapel

source: Tables
de: Tische

source: Timers
de: Zeitgeber

source: Tokens
de: Token
