Repository: drwhut/tabletop-club
Catalog: game/Translations/*.po
Languages: de

source: Importing assets...
de: Assets werden importiert…

source: Missing Asset Folder
de: Fehlender Assets-Ordner

source: Missing Module
de: Fehlendes Modul

source: Loading...
de: Lade…

source: Singleplayer
de: Einzelspieler

source: Multiplayer
de: Mehrspieler

source: Options
de: Optionen

source: Quit
de: Beenden

source: Import Log
de: Importprotokoll

source: Tabletop Club on Itch.io
de: Tabletop Club auf Itch.io

source: Source Code
de: Quelltext

source: Documentation
de: Dokumentation

source: Host Game
de: Spiel erstellen

source: Create a new lobby for your friends to join over the Internet.
de: Erstelle eine Lobby, der deine Freunde über das Internet beitreten können.

source: Join Game
de: Spiel beitreten

source: Use a room code to join your friend's lobby.
de: Verwende einen Raum-Code um der Lobby eine*r Freund*in beizutreten.

source: Enter Room Code
de: Raum-Code eingeben

source: Room Code:
de: Raum-Code:

source: Error
de: Fehler

source: Master Volume
de: Gesamtlautstärke

source: Sets the overall volume of all sources of sound in the game.
de: Legt die Gesamtlautstärke aller Tonquellen im Spiel fest.

source: Music Volume
de: Musiklautstärke

source: Sets the volume of all music sources in the game.
de: Legt die Lautstärke aller Musikquellen im Spiel fest.

source: Sounds Volume
de: Effektlautstärke

source: Sets the volume of sound sources played manually throughout the game, for example, from speakers.
de: Legt die Lautstärke von Soundquellen fest, die während des gesamten Spiels manuell wiedergegeben werden, z. B. über Lautsprecher.

source: Effects Volume
de: Effektlautstärke

source: Sets the volume of sound effects played automatically throughout the game, for example, pieces falling on the table.
de: Legt die Lautstärke von Soundeffekten fest, die während des Spiels automatisch abgespielt werden, z. B. das Fallen von Spielsteinen auf den Tisch.

source: Controls
de: Steuerung

source: Mouse Horizontal Sensitivity
de: Horizontale Mausempfindlichkeit

source: Sets the horizontal sensitivity of the rotation of the camera.
de: Legt die horizontale Empfindlichkeit für die Drehung der Kamera fest.

source: Mouse Vertical Sensitivity
de: Vertikale Mausempfindlichkeit

source: Sets the vertical sensitivity of the rotation of the camera.
de: Legt die vertikale Empfindlichkeit für die Drehung der Kamera fest.

source: Mouse Horizontal Invert
de: Maus horizontal gespiegelt

source: Used to invert the rotation of the camera horizontally.
de: Wird verwendet, um die horizontale Drehung der Kamera umzukehren.

source: Mouse Vertical Invert
de: Maus vertikal gespiegelt

source: Used to invert the rotation of the camera vertically.
de: Wird verwendet, um die vertikale Drehung der Kamera umzukehren.

source: Camera Movement Speed
de: Kamera Geschwindigkeit

source: Used to set how fast the camera moves across the table.
de: Wird verwendet, um einzustellen, wie schnell sich die Kamera über den Tisch bewegt.

source: Hold Left Click to Move Camera
de: Kamera mit gedrückter linker Maustaste bewegen

source: Used to allow the player to move the camera by dragging the mouse across the table.
de: Verwendet, damit der Spieler die Kamera durch Ziehen der Maus über den Tisch bewegen kann.

source: Zoom Sensitivity
de: Zoom Empfindlichkeit

source: Sets how fast the camera zooms in and out of the table when using the scroll wheel.
de: Legt fest, wie schnell die Kamera bei Verwendung des Scrollrads in die Tabelle hinein- und herauszoomt.

source: Zoom Invert
de: Zoom invertiert

source: Used to invert the direction of zooming when using the scroll wheel.
de: Wird verwendet, um die Zoomrichtung umzukehren, wenn das Scrollrad verwendet wird.

source: Piece Lift Sensitivity
de: Spielstein anheben Empfindlichkeit

source: Sets how fast a piece will move when lifting it off the table.
de: Legt fest, wie schnell sich eine Figur bewegt, wenn sie vom Tisch gehoben wird.

source: Piece Lift Invert
de: Spielstein anheben Umkehrung

source: Used to invert the direction a piece will go when lifting it off the table.
de: Wird verwendet, um die Richtung umzukehren, in die ein Spielstein geht, wenn es vom Tisch gehoben wird.

source: Piece Rotation Invert
de: Spielstein drehen Umkehrung

source: Used to invert the direction a piece will rotate.
de: Wird verwendet, um die Drehrichtung eines Spielsteins zu invertieren.

source: Hand Preview Enabled
de: Handvorschau aktiv

source: When set, hovering over a card in your hand will display an enhanced preview of the card after a short period of time.
de: Wenn diese Funktion aktiviert ist, wird beim Bewegen des Mauszeigers über eine Karte in deiner Hand nach kurzer Zeit eine erweiterte Vorschau der Karte angezeigt.

source: Hand Preview Delay
de: Handvorschau Verzögerung

source: Used to set how long the mouse needs to be kept still before a preview of a card is displayed from the hand.
de: Legt fest, wie lange die Maus still gehalten werden muss, bevor eine Vorschau einer Karte aus der Hand angezeigt wird.

source: Hand Preview Size
de: Handvorschau Größe

source: Used to control how large the card preview is.
de: Legt die Größe der Handvorschau fest.

source: Hide Control Hints
de: Steuerungstipps verstecken

source: Used to hide the dynamic text displaying how to control the game.
de: Versteckt den Erklärungstext zur Spielsteuerung.

source: General
de: Allgemein

source: Language
de: Sprache

source: Autosave Interval
de: Autosave Intervall

source: Used to set how often autosaves are created.
de: Legt fest, wie oft automatische Speicherpunkte angelegt werden.

source: 5 minutes
de: 5 Minuten

source: Autosave File Count
de: Anzahl der Autosave-Dateien

source: Used to set the maximum number of autosave files that are made.
de: Legt die maximale Anzahl automatischer Speicherpunkte fest die angelegt werden.

source: Skip Splash Screen
de: Splash Screen überspringen

source: Skips the Godot Engine splash screen when the game starts.
de: Überspringt den Godot Engine Splash Screen beim Spielstart.

source: Show System Warnings
de: Zeige Systemwarnungen an

source: Displays system warnings in the chat box.
de: Zeige System-Warnungen im Chatfenster.

source: Show System Errors
de: Zeige Systemfehler an

source: Displays system errors in the chat box.
de: Zeige System-Fehler im Chatfenster.

source: Opens the assets folder in your file explorer.
de: Öffnet den Assets-Ordner im Dateimanager.

source: Open Assets Folder
de: Assets-Ordner öffnen

source: Reimport Assets
de: Assets neu importieren

source: Key Bindings
de: Tastenbelegungen

source: Move Forward
de: Vorwärts bewegen

source: Moves the camera forward.
de: Bewegt die Kamera vorwärts.

source: Move Back
de: Rückwärts bewegen

source: Moves the camera backwards.
de: Bewegt die Kamera rückwärts.

source: Move Left
de: Links

source: Moves the camera left.
de: Bewegt die Kamera links.

source: Move Right
de: Rechts

source: Moves the camera right.
de: Bewegt die Kamera rechts.

source: Rotate Camera
de: Kamera drehen

source: Enable rotation of the camera when moving the mouse.
de: Aktiviert die Drehung der Kamera mit der Maus.

source: Reset Camera
de: Kamera zurücksetzen

source: Resets the camera to the default position.
de: Setzt die Kamera auf die Standardposition zurück.

source: Zoom In / Lift Piece Down
de: Vergrößern / Figur Senken

source: Zoom the camera towards the table, or lift a piece down onto the table.
de: Die Kamera an den Tisch heranzoomen, oder eine Figur herunter auf den Tisch senken.

source: Zoom Out / Lift Piece Up
de: Herauszoomen / Figur Anheben

source: Zoom the camera away from the table, or lift a piece up from the table.
de: Zoomt die Kamera oder das Objekt vom Tisch weg, oder hebt einen Spielstein vom Tisch hoch.

source: Flip Piece Orientation
de: Spielstein Umdrehen

source: Flip the selected piece or the piece the mouse is over on the horizontal axis.
de: Spiegelt den ausgewählten Spielstein oder der über der die Maus ist um die horizontale Achse.

source: Reset Piece Orientation
de: Spielstein-Ausrichtung Zurücksetzen

source: Resets the selected piece or the piece the mouse is over to its default orientation.
de: Setzt die Ausrichtung des ausgewählten Spielsteins oder der über der die Maus ist auf die Ausgangsposition zurück.

source: Rotate Piece
de: Figur Drehen

source: Rotates the the piece that is selected, or that the mouse is over.
de: Rotiert den ausgewählten Spielstein, oder den über der die Maus ist.

source: Shuffle
de: Mischen

source: Shuffle stacks of cards or tokens that are selected, or that the mouse is over.
de: Ausgewählte Kartenstapel oder Spielsteine mischen, oder die über der die Maus ist.

source: Lock/Unlock Piece
de: Spielstein ent-/sperren

source: Toggles the lock on the selected piece, fixing its position and rotation.
de: Sperrt oder Entsperrt die Position und Drehung des Spielsteins.

source: Delete Piece
de: Spielstein entfernen

source: Deletes the currently selected piece.
de: Entfernt den ausgewählten Spielstein.

source: Toggle Debug Info
de: Debug-Info umschalten

source: Toggles whether debug information is displayed.
de: Blendet Debug-Informationen ein oder aus.

source: Quicksave
de: Schnellspeichern

source: Creates a quicksave file.
de: Erstellt einen gespeicherten Spielstand.

source: Quickload
de: Schnellladen

source: Loads the latest quicksave file.
de: Lädt den letzten Spielstand.

source: Toggle UI
de: Bedienelemente anzeigen

source: Toggles whether the entire UI is displayed.
de: Blendet die gesamten Bedienelemente ein oder aus.

source: Take Screenshot
de: Bildschirmfoto aufnehmen

source: Takes a screenshot of the game in its current state.
de: Nimmt ein Bildschirmfoto des Spiels in seinem aktuellen Zustand auf.

source: Used to reset the key bindings to their default values.
de: Wird verwendet, um die Tastenbelegungen auf ihre Standardwerte zurückzusetzen.

source: Reset Bindings
de: Tastenbelegungen zurücksetzen

source: The player's displayed name in multiplayer lobbies.
de: Der angezeigte Spielername in Multiplayer-Lobbys.

source: Player
de: Spieler

source: Color
de: Farbe

source: The player's displayed colour in multiplayer lobbies.
de: Die angezeigte Farbe des Spielers in Multiplayer-Lobbys.

source: Chat Font Size
de: Schriftgröße des Chats

source: Changes the size of the text in the chat box.
de: Ändert die Schriftgröße im Chatfenster.

source: Medium
de: Mittel

source: Hide Player Cursors
de: Spieler-Mauszeiger ausblenden

source: Used to stop showing other player's cursors when in multiplayer lobbies.
de: Blendet die Mauszeiger der Spieler im Mehrspielermodus aus.

source: Censor Profanity
de: Vulgäre Ausdrücke zensieren

source: Used to censor potentially offensive words in the chat window when in multiplayer lobbies.
de: Zensiert vulgäre Ausdrücke im Chatfenster des Mehrspielermodus.

source: Window Mode
de: Fenster-Modus

source: Sets the mode in which the game window is displayed.
de: Verändert den Modus in dem das Spielfenster angezeigt wird.

source: Windowed
de: Fenstermodus

source: Field of View
de: Sichtfeld

source: Sets the field of view of the in-game camera.
de: Verändert das Sichtfeld der Spielfeldkamera.

source: Shadow Detail
de: Schatten Detailgrad

source: None
de: Keine

source: Skybox Radiance Detail
de: Detailgrad des Skybox-Leuchtens

source: Low
de: Niedrig

source: Depth of Field
de: Tiefenschärfe

source: Depth of Field Amount
de: Tiefenschärfewert

source: Used to determine how much the background is blurred when using depth of field.
de: Verändert den Schärfegrad des Hintergrundes wenn der Tiefenschärfe-Modus aktiv ist.

source: Depth of Field Distance
de: Tiefenschärfedistanz

source: Used to set the threshold of what is considered the background when using depth of field.
de: Schwellwert zur Unterscheidung zwischen Vordergrund und Hintergrund.

source: Table Paint Filtering
de: Farbtabellenfilter

source: Back
de: Zurück

source: Apply
de: Anwenden

source: Please press a key or button to bind it...
de: Zum Zuordnen einen Knopf oder eine Taste betätigen…

source: Cancel
de: Abbrechen

source: Keep video settings?
de: Videoeinstellungen beibehalten?

source: Reimporting Assets
de: Assets neu importieren

source: Warning!
de: Warnung!

source: Now Playing:
de: Aktuell spielen:

source: Deal X cards
de: X Karten austeilen

source: Select track
de: Stück auswählen

source: Positional audio
de: Positionelles Audio

source: Range:
de: Bereich:

source: Take X off top
de: Von oben X nehmen

source: Take X out
de: Nimm X heraus

source: Y:
de: X:

source: Scale:
de: Maßstab:

source: Value:
de: Wert:

source: Set value
de: Wert setzen

source: Strength:
de: Stärke:

source: Metric
de: Metrisch

source: Brush Color:
de: Pinselfarbe:

source: Brush Size:
de: Pinselgröße:

source: Eraser Size:
de: Radierer Größe:

source: Select a track...
de: Wähle einen Track aus...

source: Loaded %d tracks.
de: %d Spuren geladen.

source: Missing Assets
de: Fehlende Assets

source: The host has imported assets that your client is missing. This means that you won't be able to see these assets while in this game. There are a total of %d missing assets, and %d assets differ between your client and the host's client:
de: Der Host hat Assets importiert, die deinem Client fehlen. Das bedeutet, dass du diese Assets in diesem Spiel nicht sehen kannst. Es fehlen insgesamt %d Assets und %d Assets unterscheiden sich zwischen deinem Client und dem Client des Hosts:

source: Your client is also missing %d files, and %d files differ from that of the host's, which in total is %s of data:
de: Deinem Client fehlen außerdem %d Dateien und %d Dateien unterscheiden sich von denen des Hosts, was insgesamt %s an Daten ausmacht:

source: Yes, download missing assets.
de: Ja, fehlende Assets laden.

source: No, continue without them.
de: Nein, ohne diese Assets fortfahren.

source: Download Assets?
de: Assets herunterladen?

source: Downloading...
de: Wird geladen…

source: Waiting for download...
de: Warte auf Download...

source: Waiting to verify integrity...
de: Warte auf Integritätsverifikation...

source: Waiting to import assets...
de: Warte auf Import der Assets…

source: Error!
de: Fehler!

source: Download Folder Locked
de: Downloadverzeichnis gesperrt

source: Type a message here...
de: Nachricht eingeben …

source: Send
de: Abschicken

source: Objects
de: Objekte

source: Games
de: Spiele

source: Room
de: Raum

source: Notebook
de: Notizbuch

source: Flip Table
de: Tisch umwerfen

source: Clear Table
de: Tisch bereinigen

source: Undo
de: Rückgängig

source: Menu
de: Menü

source: Add
de: Hinzufügen

source: Added %s.
de: %s hinzugefügt.

source: Added %d objects.
de: %d Objekte hinzugefügt.

source: Loaded %d games.
de: %d Spiele geladen.

source: Back to game
de: Zurück zum Spiel

source: Save game
de: Spiel speichern

source: Load game
de: Spiel laden

source: Quit to main menu
de: Beenden und zum Hauptmenü

source: Quit to desktop
de: Beenden und zum Desktop

source: Load a file
de: Eine Datei laden

source: Take
de: Nimm

source: Take All
de: Alle nehmen

source: Show advanced developer information in JSON form.
de: Erweiterte Entwicklerinformationen in JSON-Format zeigen.

source: Advanced view
de: Erweiterte Ansicht

source: + New Page
de: + Neue Seite

source: Title
de: Titel

source: Move Up
de: Aufwärts

source: Move Down
de: Abwärts

source: Delete
de: Löschen

source: Delete page?
de: Seite löschen?

source: Current table:
de: Aktueller Tisch:

source: Change table
de: Tisch wechseln

source: Current skybox:
de: Aktuelle Skybox:

source: Change skybox
de: Skybox wechseln

source: Lamp Type
de: Leuchtmittelart

source: Sunlight
de: Sonnenlicht

source: Lamp Intensity
de: Leuchtmittelintensität

source: Lamp Color
de: Farbe der Lampe

source: Select a skybox...
de: Skybox auswählen...

source: Loaded %d skyboxes.
de: %d Skyboxen geladen.

source: Select a table...
de: Wähle eine Tabelle...

source: Loaded %d tables.
de: %d Tische geladen.

source: Pack:
de: Paket:

source: Type:
de: Typ:

source: Cleaning old files...
de: Säubere alte Dateien...

source: Not bound
de: Nicht gebunden

source: Left Mouse Button
de: Linke Maustaste

source: Right Mouse Button
de: Rechte Maustaste

source: Middle Mouse Button
de: Mittlere Maustaste

source: Extra Mouse Button 1
de: Zusätzliche Maustaste 1

source: Extra Mouse Button 2
de: Zusätzliche Maustaste 2

source: Mouse Wheel Up
de: Mausrad nach oben

source: Mouse Wheel Down
de: Mausrad nach unten

source: Mouse Wheel Left
de: Mausrad links

source: Mouse Wheel Right
de: Mausrad rechts

source: Unknown Mouse Button
de: Unbekannte Maustaste

source: Unknown event type
de: Unbekannter Ereignistyp

source: Tabletop Club could not find any asset packs in the following folders:
de: Tabletop Club konnte an den folgenden Orten keinen Asset-Pakete finden:

source: Tabletop Club could not find an assets folder in any of the following places:
de: Tabletop Club konnte an keinem der folgenden Orte einen Assets-Ordner finden:

source: Please place an asset pack into one of these folders, and restart the game.
de: Bitte platziere ein Asset Paket in einen dieser Ordner und starte das Spiel neu.

source: Please create one of these folders and restart the game.
de: Bitte erstellen Sie einen dieser Ordner und starten Sie das Spiel neu.

source: <No Name>
de: <kein Name>

source: Alpha Testers
de: Alpha Tester*innen

source: Contributors
de: Mitwirkende

source: Cursors
de: Zeiger

source: Developers
de: Entwickler*innen

source: Fonts
de: Schriftarten

source: Images
de: Bilder

source: Logo and Icon
de: Logo und Icon

source: Sound Effects
de: Geräuscheffekte

source: Tool Icons
de: Werkzeugsymbole

source: Translators
de: Übersetzer*innen

source: Dutch
de: Niederländisch

source: Esperanto
de: Spanish

source: French
de: Französisch

source: German
de: Deutsch

source: Italian
de: Italienisch

source: Portuguese
de: Portugisisch

source: Russian
de: Russisch

source: Room code must be four characters long!
de: Der Raumcode muss vier Zeichen lang sein!

source: Invalid room code!
de: Ungültiger Raumcode!

source: System Default
de: Systemvoreinstellung

source: Never
de: Niemals

source: 30 seconds
de: 30 Sekunden

source: 10 minutes
de: 10 Minuten

source: 30 minutes
de: 30 Minuten

source: Borderless Fullscreen
de: Randloser Vollbildmodus

source: Fullscreen
de: Vollbildmodus

source: High
de: Hoch

source: Very High
de: Sehr Hoch

source: Small
de: Klein

source: Large
de: Groß

source: Nothing
de: Nichts

source: Now Playing: %s
de: Jetzt spielen: %s

source: Add selected objects...
de: Ausgewählte Objekte hinzufügen...

source: Count: %d
de: Anzahl: %d

source: Value: %d
de: Wert: %d

source: Put in hand
de: In die Hand nehmen

source: Collect individuals
de: Einzelne aufnehmen

source: Collect all
de: Alle aufnehmen

source: Deal cards
de: Karten austeilen

source: Take off top
de: Von oben nehmen

source: Orient all up
de: Alle nach oben ausrichten

source: Orient all down
de: Alle nach unten ausrichten

source: Suit
de: Farbe

source: Value
de: Wert

source: Sort by
de: Sortieren nach

source: Timer
de: Zeitgeber

source: Collect selected
de: Ausgewählte sammeln

source: Add objects...
de: Objekte hinzufügen...

source: Peek inside
de: Hineinblicken

source: Take objects out
de: Objekte herausnehmen

source: Speaker
de: Lautsprecher

source: Cut
de: Ausschneiden

source: Copy
de: Kopieren

source: Paste
de: Einfügen

source: Unlock
de: Entsperren

source: Lock
de: Sperren

source: Transform
de: Transformieren

source: Set spawn point here
de: Spawnpunkt hier setzen

source: Spawn object here
de: Objekt hier spawnen

source: Ctrl + %s
de: Strg + %s

source: Hold %s
de: Halte %s

source: Release %s
de: Lasse %s los

source: Scroll Wheel
de: Mausrad

source: Move camera
de: Kamera bewegen

source: Rotate camera
de: Kamera drehen

source: Hold %s + Move Mouse
de: %s halten + Maus bewegen

source: Zoom camera
de: Kamera zoomen

source: Release selected
de: Auswahl loslassen

source: Stop box selecting
de: Nicht mehr Auswählen

source: Select object
de: Objekt auswählen

source: Add to selection
de: Zur Auswahl hinzufügen

source: Take random object
de: Zufälliges Objekt nehmen

source: %s + Move Mouse
de: %s + Mausbewegung

source: Take top object
de: Oberstes Objekt nehmen

source: Grab selected
de: Ausgewählte(s) greifen

source: Grab object
de: Objekt greifen

source: Stop moving
de: Bewegung stoppen

source: Start moving
de: Bewegen

source: Box select
de: Rechteck-Auswahl

source: Flick object
de: Objekt wegschnipsen

source: Prepare to flick
de: Zum Schnipsen ansetzen

source: Stop measuring
de: Messen stoppen

source: Start measuring
de: Beginne zu messen

source: Create hidden area
de: Erstelle verstecktes Gebiet

source: Draw hidden area
de: Zeichne verstecktes Gebiet

source: Paint Table
de: Bemale Tisch

source: Erase Paint
de: Farbe entfernen

source: Object menu
de: Objekt-Menu

source: Table menu
de: Tisch-Menu

source: Stop flicking
de: Schnipsen beenden

source: Remove last ruler
de: Letztes Lineal entfernen

source: Remove hidden area
de: Verstecktes Gebiet entfernen

source: Lift selected
de: Ausgewählte anheben

source: Zoom selected
de: Ausgewählte vergrößern

source: Rotate selected
de: Ausgewählte drehen

source: Unlock selected
de: Ausgewählte entsperren

source: Lock selected
de: Ausgewählte sperren

source: Delete selected
de: Ausgewählte löschen

source: Reset orientation
de: Ausrichtung zurücksetzen

source: Flip orientation
de: Ausrichtung umkehren

source: Flip card
de: Karte umdrehen

source: Face card up
de: Karte aufdecken

source: Reset camera
de: Kamera zurücksetzen

source: Pause track
de: Track pausieren

source: Resume track
de: Track fortsetzen

source: Stop track
de: Track anhalten

source: Play track
de: Track abspielen

source: No track loaded
de: Kein Track geladen

source: Playing: %s
de: Spiele: %s

source: Loaded: %s
de: Geladen: %s

source: Pause timer
de: Zeitgeber pausieren

source: Resume timer
de: Zeitgeber fortsetzen

source: Stop countdown
de: Stoppe Countdown

source: Start countdown
de: Starte Countdown

source: Stop stopwatch
de: Stoppe Stoppuhr

source: Start stopwatch
de: Starte Stoppuhr

source: Downloading %s ...
de: Lade %s…

source: Download completed!
de: Download abgeschlossen!

source: Verified %d out of %d files!
de: %d von %d Dateien verifiziert!

source: Loaded table has no version information. Load anyway?
de: Geladener Tisch hat keine Versions-Informationen. Trotzdem laden?

source: Loaded table was saved with a different version of the game (Current: %s, Table: %s). Load anyway?
de: Geladener Tisch wurde mit einer anderen Version des Spiels gespeichert (Aktuelle: %s, Tisch: %s). Trotzdem laden?

source: Loaded table is not in the correct format.
de: Geladene Tabelle hat ein ungültiges Format.

source: Client version (%s) does not match server version (%s)!
de: Client-Version (%s) weicht von Server-Version (%s) ab!

source: Importing %s ...
de: Importiere %s…

source: Saved screenshot to '%s'.
de: Screenshot unter '%s' gespeichert.

source: Quicksave file saved.
de: Schnellspeichern abgeschlossen.

source: Connecting to the master server...
de: Verbinde zum Hauptserver…

source: Could not open the file at path '%s' (error %d).
de: Konnte Datei in Pfad '%s' nicht öffnen (Fehler %d).

source: Establishing connection with the host...
de: Verbinde mit Host...

source: Disconnected from the server! Code: %d Reason: %s
de: Verbindung zum Server getrennt! Code: %d Grund %s

source: Room has been closed by the host.
de: Der Raum wurde durch den Host geschlossen.

source: Could not connect to the master server.
de: Keine Verbindung zum Hauptserver möglich.

source: Have not joined a room yet.
de: Noch keinem Raum beigetreten.
