Repository: drwhut/tabletop-club
Catalog: docs/translations/*/LC_MESSAGES/custom_assets.po
Languages: ru

source: Asset pack structure
ru: Структура пакета ассетов

source: Locations for asset packs
ru: Местоположения для пакетов ассетов

source: At the start of the game, Tabletop Club will scan a set of given folders for asset packs. If you want the game to import your asset pack, it needs to be put into one of the following locations:
ru: В начале игры Tabletop Club просканирует набор заданных папок на наличие пакетов ассетов. Если вы хотите, чтобы игра импортировала ваш пакет ассетов, его нужно поместить в одно из следующих мест:

source: Creating an asset pack
ru: Создание пакета ассетов

source: Creating an asset pack is really easy! All you need to do is create a folder in one of the folders mentioned above, and you're done! The name of the folder will be the name of the asset pack.
ru: Создать пакет ассетов очень просто! Все, что вам нужно сделать, это создать папку в одной из папок, указанных выше, и все готово! Название папки будет названием пакета ассетов.

source: Sub-folders
ru: Подпапки

source: Every asset pack divides its assets into different sub-folders, depending on what type of asset it is, and what the file type needed for that asset type is. Note that asset packs don't need to have all of these sub-folders.
ru: Каждый пакет активов делит свои ассеты на различные подпапки в зависимости от типа ассета и типа файла, необходимого для этого типа ассета. Обратите внимание, что пакеты ассетов не обязательно должны содержать все эти подпапки.

source: Sub-folder
ru: Подпапка

source: File Type
ru: Тип файла

source: Asset Type
ru: Тип ассета

source: Object Type
ru: Тип объекта

source: N/A
ru: Н/Д

source: Configuration files
ru: Конфигурационные файлы

source: Every sub-folder can have this file, which allows you to modify the properties of assets in the subfolder.
ru: Каждая подпапка может иметь этот файл, который позволяет изменять свойства ассетов в подпапке.

source: Here is an example of a ``config.cfg`` file:
ru: Вот пример файла ``config.cfg``:

source: Here is the full list of properties you can modify in ``config.cfg``:
ru: Вот полный список свойств, которые вы можете изменить в ``config.cfg``:

source: Property Name
ru: Имя свойства

source: Data Type
ru: Тип данных

source: Used By
ru: Используется

source: Default Value
ru: Значение по умолчанию

source: Description
ru: Описание

source: Text
ru: Текст

source: Cards
ru: Карты

source: The file name of the back face of the card. The texture must be in the same folder. If blank, no back face texture is applied.
ru: Имя файла обратной стороны карты. Текстура должна находиться в той же папке. Если пусто, текстура задней поверхности не применяется.

source: Number
ru: Число

source: Tables
ru: Столы

source: Defines how high objects bounce off the table. Must be a value between ``0.0`` (no bounce) and ``1.0`` (full bounce).
ru: Определяет, насколько высоко объекты отскакивают от стола. Должно быть значение между ``0.0`` (без отскока) и ``1.0`` (полный отскок).

source: String
ru: Строка

source: Objects
ru: Объекты

source: Multiply the color of the texture by this value.
ru: Умножает цвет текстуры на это значение.

source: Boolean
ru: Логическое

source: Skyboxes, Tables
ru: Скайбоксы, столы

source: If ``true``, the asset is loaded before the game starts. If ``true`` for multiple assets, one is loaded at random.
ru: Если ``true``, ассет загружается до начала игры. Если ``true`` для нескольких ассетов, один из них загружается случайным образом.

source: All
ru: Все

source: Describes the asset in more detail.
ru: Описывает ассет более подробно.

source: Dictionary
ru: Словарь

source: Dice
ru: Кости

source: Specifies which rotations correspond to what values on the faces of the die. See :ref:`object-type-dice` for more information.
ru: Указывает, какие вращения соответствуют каким значениям на гранях кубика. Дополнительную информацию см. в :ref:`object-type-dice`.

source: Array
ru: Массив

source: The positions of player's hands around the table. See :ref:`asset-type-table` for more information.
ru: Положение рук игрока за столом. Дополнительную информацию см. в :ref:`asset-type-table`.

source: If ``true``, it tells the game to ignore this asset when importing the asset pack.
ru: Если ``true``, это указывает игре игнорировать этот ассет при импорте пакета ассетов.

source: Music, Objects
ru: Музыка, Объекты

source: If ``true``, objects will have a chance of spawning in the main menu, and music will have a chance of playing in the main menu.
ru: Если ``true``, объекты будут иметь шанс появиться в главном меню, а музыка будет иметь шанс играть в главном меню.

source: The mass of the object in grams (g) when it is spawned in-game. It is recommended to set this value for more realistic physics collisions.
ru: Масса объекта в граммах (г) при его появлении в игре. Рекомендуется установить это значение для более реалистичных физических столкновений.

source: The length and width of the plane in which players can paint on the table. The centre of the plane is at the origin.
ru: Длина и ширина плоскости, в которой игроки могут рисовать на столе. Центр плоскости находится в начале координат.

source: Skyboxes
ru: Скайбоксы

source: Rotates the skybox a number of degrees in the X, Y and Z axes.
ru: Поворачивает скайбокс на несколько градусов по осям X, Y и Z.

source: Scales the object in the X, Y and Z axes in centimeters (cm). Note that for objects that use custom 3D models, this value most likely won't reflect the final size of the object.
ru: Масштабирует объект по осям X, Y и Z в сантиметрах (см). Обратите внимание, что для объектов, использующих пользовательские 3D-модели, это значение, скорее всего, не будет отражать окончательный размер объекта.

source: Determines what the object sounds like when it collides with the table. Possible values are: ``"generic"``, ``"glass"``, ``"glass_heavy"``, ``"glass_light"``, ``"metal"``, ``"metal_heavy"``, ``"metal_light"``, ``"soft"``, ``"soft_heavy"``, ``"tin"``, ``"wood"``, ``"wood_heavy"``, ``"wood_light"``.
ru: Определяет, какой звук издает объект при столкновении со столом. Возможные значения: ``"generic"``, ``"glass"``, ``"glass_heavy"``, ``"glass_light"``, ``"metal"``, ``"metal_heavy"``, ``"metal_light"``, ``"soft"``, ``"soft_heavy"``, ``"tin"``, ``"wood"``, ``"wood_heavy"``, ``"wood_light"``.

source: Containers
ru: Контейнеры

source: If ``true``, when the container is being shaken upside down, it will randomly drop items out.
ru: Если ``true``, при встряхивании контейнера вверх дном из него будут случайным образом выпадать предметы.

source: The strength of the ambient light coming from the skybox.
ru: Сила окружающего света, исходящего от скайбокса.

source: For :ref:`object-type-card` and :ref:`object-type-token` objects, you can add this file to add pre-filled stacks of those objects to the asset pack. A good example of this is for adding pre-filled decks of cards to the game.
ru: Для объектов :ref:`object-type-card` и :ref:`object-type-token` вы можете добавить этот файл, чтобы добавить предварительно заполненные стопки этих объектов в пакет ассетов. Хорошим примером этого является добавление предварительно заполненных колод карт в игру.

source: Here is an example of a ``stacks.cfg`` file:
ru: Вот пример файла ``stacks.cfg``:

source: Asset types
ru: Типы ассетов

source: Object
ru: Объект

source: An object in Tabletop Club refers to anything in-game that is dynamic (that is, it is driven by the physics engine). There are many different types of objects, each with their own special functionality:
ru: Объектом в Tabletop Club называется все, что находится в игре и является динамическим (то есть управляется физическим движком). Существует множество различных типов объектов, каждый из которых обладает своей особой функциональностью:

source: Todo
ru: В планах

source: Add images of each of the different types of objects.
ru: Добавить изображения каждого из различных типов объектов.

source: Card
ru: Карта

source: Cards are flat, rectangular-shaped objects that are stackable, and they have the unique functionality to be able to be put in a player's hand, where only the player whose hand it is can see the front face of the card.
ru: Карты - это плоские объекты прямоугольной формы, которые можно складывать в стопки, и они обладают уникальной функциональностью - их можно класть в руку игрока, при этом только игрок, в чьей руке они находятся, может видеть лицевую сторону карты.

source: Unlike other objects, you need two separate textures for cards - one for the front face, and one for the back face. The game registers each of the textures in the ``cards/`` folder as the front face of a card, but you need to tell the game where to find the back face in the ``config.cfg`` file.
ru: В отличие от других объектов, для карт нужны две отдельные текстуры - одна для лицевой стороны, другая для задней. Игра регистрирует каждую из текстур в папке ``cards/`` как лицевую сторону карты, но вам нужно указать игре, где найти заднюю сторону в файле ``config.cfg``.

source: Here is a simple example that will apply a back face texture (in this example, ``BackFace.png``) to all of the cards in the folder:
ru: Вот простой пример, который применит текстуру задней стороны (в данном примере ``BackFace.png``) ко всем картам в папке:

source: Container
ru: Контейнер

source: Containers are special objects that can hold an unlimited amount of other objects inside themselves (including other containers)! Containers are opaque, meaning you cannot see the objects physically inside of them, but you can peek inside a container by right-clicking it and pressing :guilabel:`Peek inside`, which will open a pop-up showing the contents of the container.
ru: Контейнеры - это специальные объекты, которые могут содержать неограниченное количество других объектов внутри себя (включая другие контейнеры)! Контейнеры непрозрачны, то есть вы не можете видеть физически находящиеся в них объекты, но вы можете заглянуть внутрь контейнера, щелкнув его правой кнопкой мыши и нажав :guilabel:`Заглянуть внутрь`, что откроет всплывающее окно, показывающее содержимое контейнера.

source: Objects can be placed inside a container by touching the container with the object you want to add, and objects can be randomly removed from the container by quickly dragging from the container.
ru: Объекты можно помещать внутрь контейнера, касаясь контейнера объектом, который вы хотите добавить, а объекты можно произвольно удалять из контейнера, быстро перетаскивая их из контейнера.

source: Containers can also be configured to drop items out when they are shaken upside-down by setting ``shakable = true`` in the :ref:`config-cfg` file.
ru: Контейнеры также можно настроить на выпадение предметов при встряхивании вверх дном, задав ``shakable = true`` в файле :ref:`config-cfg`.

source: Dice are objects that, when shaken, randomize their orientation.
ru: Кости - это объекты, которые при встряхивании случайным образом меняют свою ориентацию.

source: They can also be configured to report certain values depending on their orientation in the :ref:`config-cfg` file, using the ``face_values`` property:
ru: Они также могут быть настроены на сообщение определенных значений в зависимости от их ориентации в файле :ref:`config-cfg`, используя свойство ``face_values``:

source: If the face values are configured correctly, then the player will easily be able to check the total of a set of thrown dice by selecting, then right-clicking the dice. The total will be shown at the top of the context menu.
ru: Если значения граней настроены правильно, то игрок сможет легко проверить общую сумму набора брошенных костей, выбрав, а затем щелкнув правой кнопкой мыши на костях. Сумма будет показана в верхней части контекстного меню.

source: If ``face_values`` is not configured, the dice will always report ``0`` as its value.
ru: Если ``face_values`` не настроено, кубик всегда будет сообщать ``0`` в качестве своего значения.

source: Piece
ru: Деталь

source: Pieces are generic objects with no special functionality.
ru: Детали - это общие объекты, не обладающие особой функциональностью.

source: Speaker
ru: Динамик

source: Speakers are objects that can play audio tracks. They emit sound positionally, so the audio will vary depending on the position of the speaker relative to the camera.
ru: Динамики - это объекты, которые могут воспроизводить звуковые дорожки. Они издают звук позиционно, поэтому звук будет меняться в зависимости от положения динамика относительно камеры.

source: Timer
ru: Таймер

source: Timers are objects that can be used as countdowns, stopwatches, or to display the system time. If an audio track is loaded, it will automatically play when the countdown reaches 0.
ru: Таймеры - это объекты, которые можно использовать в качестве обратного отсчета, секундомеров или для отображения системного времени. Если загружена звуковая дорожка, она будет автоматически воспроизводиться, когда обратный отсчет достигнет 0.

source: Token
ru: Жетон

source: Tokens are objects that are vertically stackable, meaning they join together when their top and bottom faces touch, similar to cards.
ru: Жетоны - это объекты, которые можно складывать вертикально, то есть они соединяются, когда их верхняя и нижняя грани соприкасаются, подобно картам.

source: Sound
ru: Звук

source: Sounds can be played through either a :ref:`object-type-speaker` or a :ref:`object-type-timer`.
ru: Звуки могут воспроизводиться либо через :ref:`object-type-speaker`, либо через :ref:`object-type-timer`.

source: Music
ru: Музыка

source: Music tracks are the same as sounds, but they can also be configured to play in the main menu. See the ``main_menu`` property in :ref:`config-cfg`.
ru: Музыкальные треки - это то же самое, что и звуки, но их также можно настроить на воспроизведение в главном меню. Смотрите свойство ``main_menu`` в :ref:`config-cfg`.

source: Game
ru: Игра

source: A game is a :ref:`file-type-save` that has been pre-made such that players can instantly setup the table to play a particular game.
ru: Игра - это :ref:`file-type-save`, которая была предварительно создана таким образом, чтобы игроки могли мгновенно настроить стол для игры в определенную игру.

source: If there is an image next to the save file with the same name, it will be shown next to the save file in-game.
ru: Если рядом с файлом сохранения есть изображение с таким же именем, оно будет показано рядом с файлом сохранения в игре.

source: Skybox
ru: Скайбокс

source: Skyboxes are special textures that determine what the environment around the table looks like.
ru: Скайбоксы - это специальные текстуры, которые определяют, как выглядит окружение вокруг стола.

source: Skybox textures in Tabletop Club use equirectangular mappings, as opposed to six-image cube mappings. Godot recommends using `this tool <https://danilw.github.io/GLSL-howto/cubemap_to_panorama_js/cubemap_to_panorama.html>`_ to convert cube-mapped skyboxes to equirectangular skyboxes.
ru: Текстуры скайбоксов в Tabletop Club используют равностороннее отображение, в отличие от кубического отображения шести изображений. Godot рекомендует использовать `этот инструмент <https://danilw.github.io/GLSL-howto/cubemap_to_panorama_js/cubemap_to_panorama.html>`_ для преобразования кубических скайбоксов в равносторонние.

source: For the best lighting quality, it is recommended to use a HDR panorama. Tabletop Club supports the Radiance HDR (``.hdr``) and OpenEXR (``.exr``) formats.
ru: Для наилучшего качества освещения рекомендуется использовать HDR-панораму. Tabletop Club поддерживает форматы Radiance HDR (``.hdr``) и OpenEXR (``.exr``).

source: If the skybox is either too bright or too dim, then you can change the strength of the ambient light generated by the skybox by setting the ``strength`` value in the :ref:`config-cfg` file.
ru: Если скайбокс слишком яркий или слишком тусклый, то вы можете изменить силу окружающего света, создаваемого скайбоксом, установив значение ``strength`` в файле :ref:`config-cfg`.

source: Table
ru: Стол

source: A table is a :ref:`file-type-3d` that is placed in the centre of the game world for players to put objects on.
ru: Стол - это :ref:`file-type-3d`, который размещается в центре игрового мира, чтобы игроки могли ставить на него объекты.

source: However, unlike custom objects, the position and scale of the exported model matters. Keep the following points in mind when you export models to be used as tables:
ru: Однако, в отличие от пользовательских объектов, положение и масштаб экспортируемой модели имеют значение. Помните о следующих моментах при экспорте моделей для использования в качестве столов:

source: One unit in the exported model = one centimeter (cm) in-game.
ru: Одна единица в экспортированной модели = один сантиметр (см) в игре.

source: The lowest vertical position the camera can zoom to is ``0`` (this is either the y or z axis, depending on the program you're using).
ru: Наименьшее вертикальное положение, до которого камера может увеличить изображение, равно ``0`` (это ось y или z, в зависимости от используемой программы).

source: Tables also have a set of hand positions, which are assigned to players by the server when they join the game. These hand positions can be defined in the ``config.cfg`` file:
ru: Столы также имеют набор позиций рук, которые назначаются игрокам сервером, когда они присоединяются к игре. Эти позиции рук могут быть определены в файле ``config.cfg``:

source: Tables can also be painted on by the players! You can set the size of the area that the players can paint on by setting the ``paint_plane`` property in the :ref:`config-cfg` file.
ru: На столах также могут рисовать игроки! Вы можете установить размер области, на которой могут рисовать игроки, установив свойство ``paint_plane`` в файле :ref:`config-cfg`.

source: File types
ru: Типы файлов

source: Image
ru: Изображение

source: Supported formats
ru: Поддерживаемые форматы

source: By default, Tabletop Club supports all of the image formats that Godot supports, the list of which can be found `here <https://docs.godotengine.org/en/stable/getting_started/workflow/assets/importing_images.html>`_.
ru: По умолчанию Tabletop Club поддерживает все форматы изображений, которые поддерживает Godot, список которых можно найти `здесь <https://docs.godotengine.org/en/stable/getting_started/workflow/assets/importing_images.html>`_.

source: UV Mappings
ru: UV-преобразования

source: Every object that uses an image has something called a UV mapping, a way in which the image is "folded" onto the 3D object. Remember in maths when you had to "unfold" different shapes into nets? This is essentially the reverse of that! Knowing these UV mappings is important if you want your object to look right in-game!
ru: Каждый объект, использующий изображение, имеет так называемое UV-преобразование - способ, с помощью которого изображение "складывается" на 3D-объект. Помните, как в математике вам приходилось "раскладывать"- различные фигуры в сетки? Это, по сути, обратная операция! Знание этих UV-преобразований очень важно, если вы хотите, чтобы ваш объект выглядел правильно в игре!

source: The width and height of the images don't matter, as long as the proportions are correct!
ru: Ширина и высота изображений не имеют значения, главное, чтобы пропорции были правильными!

source: Unlike other objects, cards use two images, one for each face. See :ref:`object-type-card` for more information.
ru: В отличие от других объектов, карты используют два изображения, по одному для каждой грани. Более подробную информацию смотрите в :ref:`object-type-card`.

source: Cube
ru: Куб

source: Cylinder
ru: Цилиндр

source: 3D Model
ru: 3D модель

source: 3D models can be exported from almost any 3D modelling software, including Blender and Maya.
ru: 3D-модели можно экспортировать практически из любой программы для 3D-моделирования, включая Blender и Maya.

source: As of right now, Tabletop Club supports the following 3D file formats:
ru: На данный момент Tabletop Club поддерживает следующие форматы 3D файлов:

source: When exporting 3D models with textures, make sure that the textures are also in the same folder as the exported model. You may also need to manually edit the file to check that the textures are not being loaded with an absolute file path, otherwise the textures won't work when the model is imported!
ru: При экспорте 3D-моделей с текстурами убедитесь, что текстуры также находятся в той же папке, что и экспортируемая модель. Вам также может понадобиться вручную отредактировать файл, чтобы проверить, что текстуры не загружаются с абсолютным путем к файлу, иначе текстуры не будут работать при импорте модели!

source: Audio
ru: Звук

source: As of right now, Tabletop Club supports the following audio formats:
ru: На данный момент Tabletop Club поддерживает следующие аудиоформаты:

source: You can find out which format works best for you in the `importing audio page <https://docs.godotengine.org/en/stable/getting_started/workflow/assets/importing_audio_samples.html>`_ in the Godot documentation.
ru: Вы можете узнать, какой формат подходит вам лучше всего, на странице `импорта аудио <https://docs.godotengine.org/en/stable/getting_started/workflow/assets/importing_audio_samples.html>`_ в документации Godot.

source: Save File
ru: Файл сохранения

source: Save files are used to load back a saved state within Tabletop Club. They use the ``.tc`` extension.
ru: Файлы сохранения используются для загрузки сохраненного состояния в Tabletop Club. Они используют расширение ``.tc``.

source: To create a save file when in-game, go to the menu and click :guilabel:`Save game`, then choose a name to save the file as. You can then load the state back by clicking the :guilabel:`Load game` button in the same menu.
ru: Чтобы создать файл сохранения в игре, зайдите в меню и нажмите кнопку :guilabel:`Сохранить игру`, затем выберите имя для сохранения файла. Затем вы можете загрузить его обратно, нажав на кнопку :guilabel:`Загрузить игру` в том же меню.

source: When saving, the game puts the save file under the ``<DOCUMENTS>/TabletopClub/saves`` folder, alongside a screenshot which is taken when the save is made.
ru: При сохранении игра помещает файл сохранения в папку ``<DOCUMENTS>/TabletopClub/saves``, а также скриншот, который делается в момент сохранения.

source: If you don't want the screenshot to have the UI, you can toggle the UI before saving by pressing the :guilabel:`F9` key.
ru: Если вы не хотите, чтобы на скриншоте был пользовательский интерфейс, вы можете отключить его перед сохранением, нажав клавишу :guilabel:`F9`.

source: Asset packs
ru: Пакеты ассетов

source: To make the management and sharing of custom assets easier, assets are put into what are called **asset packs**, which are essentially just specially-made folders. This chapter describes the specification for the custom assets, and the asset packs that contain them.
ru: Чтобы упростить управление и обмен пользовательскими ассетами, они помещаются в так называемые **пакеты ассетов**, которые, по сути, представляют собой специально созданные папки. В этой главе описывается спецификация пользовательских ассетов и пакетов ассетов, которые их содержат.

source: For reference, you can have a look at the Tabletop Club asset pack, which comes with the game by default.
ru: Для справки вы можете взглянуть на пакет ассетов Tabletop Club, который поставляется с игрой по умолчанию.

source: For easy-to-follow tutorials on how to make assets and asset packs, see :ref:`custom-asset-tutorials`.
ru: Простые и понятные руководства по созданию ассетов и пакетов ассетов смотрите на странице ":ref:`custom-asset-tutorials`".

source: Tutorials
ru: Руководства

source: Add tutorials for creating assets for asset packs.
ru: Добавить руководства по созданию ассетов для пакетов ассетов.
