Repository: drwhut/tabletop-club
Catalog: docs/translations/*/LC_MESSAGES/general.po
Languages: ru

source: Make sure to include as much information as you can in the post, including how to reproduce the bug, the platform you're running the game on, and if possible, provide the latest log so we can check if there were any errors thrown. You can find the game logs in the following folders:
ru: Обязательно укажите в сообщении как можно больше информации, включая способ воспроизведения ошибки, платформу, на которой вы запускаете игру, и, если возможно, предоставьте последний лог, чтобы мы могли проверить, были ли какие-либо ошибки. Логи игры можно найти в следующих папках:

source: If you want to provide an in-game screenshot showing the bug, you can press :guilabel:`F3` to display debug information on the screen, then you can press :guilabel:`F12` to take a screenshot! Screenshots are saved to the Documents folder under ``TabletopClub/screenshots``.
ru: Если вы хотите предоставить внутриигровой скриншот, демонстрирующий ошибку, вы можете нажать :guilabel:`F3` для отображения отладочной информации на экране, а затем нажать :guilabel:`F12` для создания скриншота! Скриншоты сохраняются в папке Документы в ``TabletopClub/screenshots``.

source: Suggesting a feature
ru: Предложить функцию

source: Have you got an idea to make the game better? If someone else hasn't had the same idea (you can check by searching the `issues page`_ on GitHub), then you can `post an issue`_ on GitHub explaining your idea, what problem it solves, and any alternative ideas you've thought of. We want to make the game as good as it can possibly be, so don't hesistate to let us know your idea!
ru: У вас есть идея, как сделать игру лучше? Если у кого-то еще не было такой же идеи (вы можете проверить это, воспользовавшись поиском на `странице проблем`_ на GitHub), то вы можете `разместить проблему`_ на GitHub, объяснив свою идею, какую проблему она решает, и любые альтернативные идеи, которые вы придумали. Мы хотим сделать игру настолько хорошей, насколько это возможно, поэтому не стесняйтесь сообщить нам о своей идее!

source: Changing the documentation
ru: Изменить документацию

source: If there is a part of the documentation that you don't understand, or that you think is missing, then please don't hesistate to suggest a change to the documentation:
ru: Если есть часть документации, которую вы не понимаете, или которая, по вашему мнению, отсутствует, пожалуйста, не стесняйтесь предложить изменения в документации:

source: You can `post an issue`_ with the documentation change template describing the edit you want.
ru: Вы можете `разместить проблему`_ с шаблоном изменения документации, описывающим нужную вам правку.

source: You can click on the GitHub icon at the top of the page, click the :guilabel:`suggest edit` button, and create a pull request with the changes you give!
ru: Вы можете нажать на значок GitHub в верхней части страницы, нажать на кнопку :guilabel:`предложить изменения` и создать запрос на слияние с изменениями, которые вы внесли!

source: Translating the project
ru: Перевести проект

source: If you know a language other than English, you can help to translate the game and it's documentation by going to the project's `Hosted Weblate <https://hosted.weblate.org/engage/tabletop-club/>`_ page and suggest translations for the project's strings in your language!
ru: Если вы знаете язык, отличный от английского, вы можете помочь перевести игру и документацию к ней, зайдя на страницу проекта на `Weblate <https://hosted.weblate.org/engage/tabletop-club/>`_ и предложить перевод строк проекта на ваш язык!

source: If you don't see your language in a component, you can add it by scrolling to the bottom of the component page and pressing :guilabel:`Start new translation`.
ru: Если вы не видите свой язык в компоненте, вы можете добавить его, прокрутив страницу компонента вниз и нажав :guilabel:`Начать новый перевод`.

source: Manual pull requests for translations will be closed, as Weblate keeps it's own fork of the project, and we want to avoid having merge conflicts occur.
ru: Ручные запросы на слияние переводов будут закрыты, так как Weblate сохраняет свой собственный форк проекта, и мы хотим избежать возникновения конфликтов слияния.

source: Translation status
ru: Статус перевода

source: If you see an issue on the `GitHub repository`_ that you think you can fix, and you want to directly contribute to the project by modifying the game code, you can create a pull request on GitHub to merge your changes in! See the :ref:`pull-request-workflow` page for more information.
ru: Если вы видите проблему в репозитории `GitHub`_, которую, по вашему мнению, можно исправить, и вы хотите внести непосредственный вклад в проект, изменив код игры, вы можете создать запрос на слияние на GitHub, чтобы объединить ваши изменения! Смотрите страницу ":ref:`pull-request-workflow`" для получения дополнительной информации.

source: Proposing assets
ru: Предложить ассеты

source: If you see an issue on the `GitHub repository`_ that needs game assets to fix (like textures, 3D models, sound effects, music, etc.), then you can reply to that issue with either an asset you've found online, or one that you've made yourself!
ru: Если вы видите проблему в `репозитории GitHub`_, для исправления которой нужны игровые ассеты (например, текстуры, 3D-модели, звуковые эффекты, музыка и т.д.), то вы можете ответить на эту проблему либо ассетом, который вы нашли в сети, либо тем, который вы сделали сами!

source: If the asset doesn't solve an issue, but you still think Tabletop Club would benefit from having it, then you can `post an issue`_ with the asset submission template instead!
ru: Если ассет не решает проблему, но вы все равно считаете, что Tabletop Club выиграет от его наличия, то вы можете `разместить проблему`_ с помощью шаблона подачи ассета!

source: However you propose the asset, you need to provide the following information:
ru: Как бы вы ни предлагали ассет, вам необходимо предоставить следующую информацию:

source: The name of the asset.
ru: Название ассета.

source: The name of the author.
ru: Имя автора.

source: The license the asset is under - keep in mind that we will only include assets with open licenses, e.g. `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`_.
ru: Лицензия, под которой находится ассет - помните, что мы будем включать только ассеты с открытыми лицензиями, например, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`_.

source: The URL where the asset can be downloaded from. The URL must be publically accessible, and it must lead to a trusted website.
ru: URL-адрес, с которого можно загрузить ассет. URL должен быть общедоступным и вести на надежный сайт.

source: Compiling from the source code
ru: Компиляция из исходного кода

source: Downloading the Godot fork
ru: Загрузка форка Godot

source: The first step in compiling the game from scratch is to download and compile the game engine it runs on - `Godot <https://godotengine.org/>`_. Godot is a free and open-source 2D and 3D game engine, and it has all the functionality we need to make the game, except for one...
ru: Первым шагом в компиляции игры с нуля является загрузка и компиляция игрового движка, на котором она работает - `Godot <https://godotengine.org/>`_. Godot - это бесплатный игровой движок с открытым исходным кодом для 2D и 3D игр, и в нем есть все функции, необходимые нам для создания игры, за исключением одной…

source: At this point, if you've used Godot in the past, you might be wondering "wait, if it uses Godot, can't we just download Godot from the website and import the project?". Not quite, because we've needed to add our own little bit of code on top of vanilla Godot, so to compile the game we need to download and compile `a modified version of Godot <https://github.com/drwhut/godot>`_. If you're interested as to why we've modified Godot, see :ref:`why-modify-godot`.
ru: На данный момент, если вы использовали Godot в прошлом, вы можете задаться вопросом: «Подождите, если он использует Godot, разве мы не можем просто загрузить Godot с веб-сайта и импортировать проект?». Не совсем, потому что нам нужно было добавить наш собственный небольшой кусочек кода поверх ванильного Godot, поэтому для компиляции игры нам нужно загрузить и скомпилировать 'модифицированную версию Godot <https://github.com/drwhut/godot>'. Если вам интересно, почему мы модифицировали Godot, см. :ref:`why-modify-godot`.

source: To download the modified Godot, you'll need to have ``git`` installed on your computer (this will come in useful later as well). Then you can use this command in a terminal to download the fork of Godot:
ru: Чтобы загрузить модифицированный Godot, вам нужно, чтобы на вашем компьютере был установлен ``git`` (это пригодится и позже). Затем вы можете использовать эту команду в терминале для загрузки форка Godot:

source: The version number after ``-b tabletop`` refers to the Godot version the modified code is based on. You might need to change which version of Godot to download if you're planning on downloading a specific version of Tabletop Club, as different versions of Tabletop Club might use different versions of Godot.
ru: Номер версии после ``-b tabletop`` относится к версии Godot, на которой основан измененный код. Вам может понадобиться изменить версию Godot для загрузки, если вы планируете загрузить определенную версию Tabletop Club, поскольку разные версии Tabletop Club могут использовать разные версии Godot.

source: If you just plan on downloading the current ``master`` branch from Tabletop Club, then you don't need to change the above command.
ru: Если вы просто планируете загрузить текущую ``master`` ветку Tabletop Club, то вам не нужно менять приведенную выше команду.

source: If you know which version of Tabletop Club you want to download, check the ``README.md`` file in it's source code and look for a command similar to the one above. Then, replace what comes after the ``-b`` above with what the ``README.md`` file says. This way, you know you're compiling a compatible version of Godot for the Tabletop Club version you want.
ru: Если вы знаете, какую версию Tabletop Club вы хотите загрузить, проверьте файл ``README.md`` в его исходном коде и найдите команду, аналогичную приведенной выше. Затем замените то, что идет после ``-b`` выше, на то, что написано в файле ``README.md``. Таким образом, вы знаете, что компилируете совместимую версию Godot для версии Tabletop Club, которую вы хотите.

source: Compiling Godot
ru: Компиляция Godot

source: The way you compile Godot's source code is exactly how you would normally compile Godot, the documentation of which can be found `here <https://docs.godotengine.org/en/stable/development/compiling/index.html>`_. For convenience, the instructions from the Godot documentation has been taken, modified slightly, and put here for each platform [#godot-doc-license]_.
ru: Способ компиляции исходного кода Godot в точности соответствует тому, как вы обычно компилируете Godot, документацию которого можно найти `здесь <https://docs.godotengine.org/en/stable/development/compiling/index.html>`_. Для удобства, инструкции из документации Godot были взяты, немного изменены и помещены здесь для каждой платформы [#godot-doc-license]_.

source: For all platforms, you will need *at least* the following:
ru: Для всех платформ вам потребуется *как минимум* следующее:

source: `Python 3.5+ <https://www.python.org/downloads/>`_. Make sure Python is added to your ``PATH`` environment variable.
ru: `Python 3.5+ <https://www.python.org/downloads/>`_. Убедитесь, что Python добавлен в вашу переменную окружения ``PATH``.

source: `SCons 3.0+ <https://www.scons.org/>`_. Once you have Python installed, you can install it by opening a terminal/command prompt and running:
ru: `SCons 3.0+ <https://www.scons.org/>`_. После установки Python, вы можете установить его, открыв терминал/командную строку и выполнив:

source: You can check to see whether you have installed Python and SCons correctly by running:
ru: Вы можете проверить, правильно ли вы установили Python и SCons, выполнив команду:

source: Compiling Godot for Windows
ru: Компиляция Godot для Windows

source: Requirements
ru: Требования

source: To compile Godot for Windows, you'll also need the following:
ru: Чтобы скомпилировать Godot для Windows, вам также понадобится следующее:

source: `Visual Studio Community <https://visualstudio.microsoft.com/vs/community/>`_ version 2017 or later. You'll need to install it with C++ support - if you've already installed Visual Studio without C++ support, you can re-run the installer and click :guilabel:`Modify` to install the C++ tools.
ru: `Visual Studio Community <https://visualstudio.microsoft.com/vs/community/>`_ версии 2017 или более поздней. Вам нужно будет установить ее с поддержкой C++ - если вы уже установили Visual Studio без поддержки C++, вы можете повторно запустить программу установки и нажать :guilabel:`Изменить` для установки инструментов C++.

source: `MinGW-w64 <http://mingw-w64.org/doku.php>`_ with GCC can be used as an alternative to Visual Studio. You'll need to configure it to use the ``posix`` thread model.
ru: `MinGW-w64 <http://mingw-w64.org/doku.php>`_ с GCC можно использовать как альтернативу Visual Studio. Вам необходимо настроить его на использование ``posix`` потоковой модели.

source: Compiling
ru: Компиляция

source: To compile the engine, open a command prompt, change to the root directory of the engine code (using ``cd``), and run:
ru: Чтобы скомпилировать движок, откройте командную строку, перейдите в корневой каталог кода движка (используя ``cd``) и запустите:

source: The ``-j8`` means that SCons will use eight threads to compile Godot. To make compiling faster, it's best to have this number be the same as the number of logical cores in your CPU.
ru: ``-j8`` означает, что SCons будет использовать восемь потоков для компиляции Godot. Чтобы компиляция шла быстрее, лучше всего, если это число будет равно количеству логических ядер вашего процессора.

source: If it compiles successfully, the result binary will be put in ``godot/bin/`` with the name ``godot.windows.opt.tools.32.exe`` or ``godot.windows.opt.tools.64.exe``. By default, SCons will build a binary matching your CPU architecture, but this can be changed by adding ``bits=64`` or ``bits=32`` to the above command.
ru: Если компиляция прошла успешно, двоичный файл будет помещен в ``godot/bin/`` с именем ``godot.windows.opt.tools.32.exe`` или ``godot.windows.opt.tools.64.exe``. По умолчанию SCons будет собирать двоичный файл, соответствующий архитектуре вашего процессора, но это можно изменить, добавив ``bits=64`` или ``bits=32`` к приведенной выше команде.

source: Creating a Visual Studio project
ru: Создание проекта Visual Studio

source: If you want to create a Visual Studio solution for compiling Godot instead (which can come in handy if you plan to modify the Godot source code), you can run SCons with the ``vsproj=yes`` parameter added:
ru: Если вы хотите создать решение Visual Studio для компиляции Godot (что может пригодиться, если вы планируете изменять исходный код Godot), вы можете запустить SCons с добавленным параметром ``vsproj=yes``:

source: Building an export template
ru: Создание шаблона экспорта

source: If you want to compile an export template to export a release build of the game from the editor, you can use the following comamnd:
ru: Если вы хотите скомпилировать шаблон экспорта для экспорта релизной сборки игры из редактора, вы можете использовать следующую комманду:

source: Compiling Godot for macOS
ru: Компиляция Godot для macOS

source: To compile Godot for macOS, you'll also need `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_.
ru: Для компиляции Godot для macOS вам также понадобится `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_.

source: Start a terminal and go to the root directory of the engine code.
ru: Запустите терминал и перейдите в корневой каталог кода движка.

source: To compile for Intel (x86_64) CPUs, use:
ru: Для компиляции для процессоров Intel (x86_64) используйте:

source: To compile for Apple Silicon (ARM64) CPUs, use:
ru: Для компиляции для процессоров Apple Silicon (ARM64) используйте:

source: To support both architectures in a single "Universal 2" binary, run the above two commands, then use ``lipo`` to bundle them together:
ru: Для поддержки обеих архитектур в одном двоичном файле "Universal 2" выполните две вышеуказанные команды, а затем используйте ``lipo`` для их объединения:

source: If it compiles successfully, the result binary will be put in ``godot/bin/``.
ru: Если компиляция прошла успешно, то двоичный файл будет помещен в ``godot/bin/``.

source: To create an ``.app`` bundle like in the official builds, you need to use the template provided in ``misc/dist/osx_tools.app``:
ru: Чтобы создать пакет ``.app``, как в официальных сборках, необходимо использовать шаблон, представленный в ``misc/dist/osx_tools.app``:

source: If you want to compile an export template to export a release build of the game from the editor, you can use the following commands:
ru: Если вы хотите скомпилировать шаблон экспорта для экспорта релизной сборки игры из редактора, вы можете использовать следующие команды:

source: Compiling Godot for Linux / \*BSD
ru: Компиляция Godot для Linux / \*BSD

source: To compile Godot for Linux and other Unix systems, you'll also need the following:
ru: Чтобы скомпилировать Godot для Linux и других Unix-систем, вам также понадобится следующее:

source: GCC 7+ or Clang 6+.
ru: GCC 7+ или Clang 6+.

source: X11, Xcursor, Ximerama, Xi and XRandR development libraries.
ru: Библиотеки разработки X11, Xcursor, Ximerama, Xi и XRandR.

source: MesaGL development libraries.
ru: Библиотеки разработки MesaGL.

source: ALSA development libraries.
ru: Библиотеки разработки ALSA.

source: PulseAudio development libraries.
ru: Библиотеки разработки PulseAudio.

source: Distro-specific one-liners
ru: Однострочные команды для дистрибутивов

source: For audio support, you can optionally install ``pulseaudio``.
ru: Для поддержки звука вы можете дополнительно установить ``pulseaudio``.

source: To compile the engine, open a terminal, change to the root directory of the engine code, and run:
ru: Чтобы скомпилировать движок, откройте терминал, перейдите в корневой каталог кода движка и выполните команду:

source: If it compiles successfully, the result binary will be put in ``godot/bin/`` with the name ``godot.x11.opt.tools.32`` or ``godot.x11.opt.tools.64``. By default, SCons will build a binary matching your CPU architecture, but this can be changed by adding ``bits=64`` or ``bits=32`` to the above command.
ru: Если компиляция прошла успешно, то двоичный файл будет помещен в ``godot/bin/`` с именем ``godot.x11.opt.tools.32`` или ``godot.x11.opt.tools.64``. По умолчанию SCons будет собирать двоичный файл, соответствующий архитектуре вашего процессора, но это можно изменить, добавив ``bits=64`` или ``bits=32`` к приведенной выше команде.

source: If you want to compile using Clang instead of GCC, use this command:
ru: Если вы хотите компилировать с помощью Clang вместо GCC, используйте эту команду:

source: If you want to compile an export template to export a release build of the game from the editor, you can use the following command:
ru: Если вы хотите скомпилировать шаблон экспорта для экспорта релизной сборки игры из редактора, вы можете использовать следующую команду:

source: Downloading Tabletop Club
ru: Загрузка Tabletop Club

source: To download the Tabletop Club Godot project, you can either download a compressed copy of the source code for a particular version from the `releases <https://github.com/drwhut/tabletop-club/releases>`_ page on GitHub and extract it, or if you're feeling very adventurous, you can download the latest source code on the ``master`` branch by running this command:
ru: Чтобы загрузить Godot проект Tabletop Club, вы можете либо загрузить сжатую копию исходного кода для конкретной версии со страницы `релизов <https://github.com/drwhut/tabletop-club/releases>`_ на GitHub и извлечь ее, либо, если вы чувствуете себя авантюристом, вы можете загрузить последний исходный код в ветке ``master``, выполнив эту команду:

source: Downloading the WebRTC GDNative plugin
ru: Загрузка плагина WebRTC GDNative

source: Since the multiplayer for Tabletop Club uses WebRTC, you'll need to download the WebRTC plugin for Godot. You can follow these instructions to setup the plugin:
ru: Поскольку многопользовательская игр в Tabletop Club использует WebRTC, вам необходимо загрузить плагин WebRTC для Godot. Вы можете следовать этим инструкциям для установки плагина:

source: Download the latest release of the plugin from `the repository <https://github.com/godotengine/webrtc-native/releases>`_. Make sure to download the ``release`` build.
ru: Скачайте последнюю версию плагина из `репозитория <https://github.com/godotengine/webrtc-native/releases>`_. Убедитесь, что скачали ``release`` сборку.

source: Open the compressed file, and place the ``webrtc/`` folder into ``tabletop-club/game/``. Afterwards, there should be a file at ``tabletop-club/game/webrtc/webrtc.tres``.
ru: Откройте сжатый файл и поместите папку ``webrtc/`` в ``tabletop-club/game/``. После этого должен появиться файл по адресу ``tabletop-club/game/webrtc/webrtc.tres``.

source: Running Tabletop Club in the Godot editor
ru: Запуск Tabletop Club в редакторе Godot

source: To open Godot's project manager, run the executable you compiled in ``godot/bin/``. You can then import the project by clicking the :guilabel:`Import` button and selecting the ``tabletop-club/game/project.godot`` file. Now you can open the project and play the game by pressing the play button in the top-right corner (or by pressing F5)!
ru: Чтобы открыть менеджер проектов Godot, запустите исполняемый файл, который вы скомпилировали в ``godot/bin/``. Затем вы можете импортировать проект, нажав кнопку :guilabel:`Импорт` и выбрав файл ``tabletop-club/game/project.godot``. Теперь вы можете открыть проект и начать играть, нажав кнопку играть в правом верхнем углу (или нажав F5)!

source: At this point, you can modify the game to your heart's content! Have a look at the scenes and scripts, try tweaking things here and there, or maybe try and add some stuff of your own?
ru: На этом этапе вы можете изменять игру по своему усмотрению! Посмотрите на сцены и скрипты, попробуйте подправить то тут, то там, а может быть, попробуйте добавить что-то свое?

source: Exporting the game
ru: Экспорт игры

source: You can export the game with the editor to make it so you don't need to run the game through the editor to play it. Here's how you can export the project:
ru: Вы можете экспортировать игру с помощью редактора, чтобы вам не нужно было запускать игру через редактор, для того чтобы поиграть в нее. Вот как можно эксортировать проект:

source: Click on :guilabel:`Project` > :guilabel:`Export...`
ru: Нажмите на :guilabel:`Проект` > :guilabel:`Экспорт…`

source: In the pop-up, click :guilabel:`Add...`, and select your platform.
ru: Во всплывающем окне нажмите :guilabel:`Добавить…`, и выберите вашу платформу.

source: In the menu on the right, set the debug template to point to the editor executable, and if you made a release template, set that as well.
ru: В меню справа установите шаблон отладки, указывающий на исполняемый файл редактора, а если вы создали шаблон релиза, установите и его.

source: Click :guilabel:`Export project`, choose where you want to export the project and whether you want to export a debug or a release binary, then click :guilabel:`Save`.
ru: Нажмите :guilabel:`Экспортировать проект`, выберите место, куда вы хотите экспортировать проект и хотите ли вы экспортировать отладочный или релизный двоичный файл, затем нажмите :guilabel:`Сохранить`.
