Repository: drwhut/tabletop-club
Catalog: docs/translations/*/LC_MESSAGES/general.po
Languages: ru

source: About
ru: О проекте

source: What is Tabletop Club?
ru: Что такое Tabletop Club?

source: Tabletop Club is a free and open-source tabletop board game simulator! That's a bit of a mouthful, so I'll break that sentence down a bit:
ru: Tabletop Club - это бесплатный симулятор настольных игр с открытым исходным кодом! Это немного многословно, поэтому я разобью это предложение на части:

source: Free
ru: Бесплатный

source: The game is completely free to download and play! You can do so by going to the :ref:`downloading-binaries` page.
ru: Игру можно скачать и играть совершенно бесплатно! Вы можете сделать это, перейдя на страницу ":ref:`downloading-binaries`".

source: Open-source
ru: С открытым исходным кодом

source: This means a few things:
ru: Это означает несколько вещей:

source: The source code of the game is visible to the public (you can see it in the `GitHub repository <https://github.com/drwhut/tabletop-club>`_). This also means you can compile the game youself from scratch (see :ref:`compiling-from-source`).
ru: Исходный код игры находится в открытом доступе (вы можете увидеть его в репозитории `GitHub <https://github.com/drwhut/tabletop-club>`_). Это также означает, что вы можете самостоятельно скомпилировать игру с нуля (см. :ref:`compiling-from-source`).

source: Anyone can contribute to the development of Tabletop Club in a number of different ways! For more information about how you can help contribute to the project, visit the :ref:`contributing` page.
ru: Любой желающий может внести свой вклад в развитие Tabletop Club различными способами! Для получения дополнительной информации о том, как вы можете внести свой вклад в проект, посетите страницу ":ref:`contributing`".

source: The game is licensed under the `MIT License <https://github.com/drwhut/tabletop-club/blob/master/LICENSE>`_, which is an open, permissive license.
ru: Игра лицензирована по лицензии `MIT <https://github.com/drwhut/tabletop-club/blob/master/LICENSE>`_, которая является открытой, разрешительной лицензией.

source: The game's code and project files are licensed under the MIT License, but some of the assets are licensed under different open licenses.
ru: Код игры и файлы проекта лицензированы по лицензии MIT, но некоторые из ассетов лицензированы под другими открытыми лицензиям.

source: Tabletop board game
ru: Настольных игр

source: The game is designed to allow you to play your favourite tabletop board games by effectively giving you a box of toys to play with (which include things like cards, dice, game pieces, and more), and it's up to you what you do with what you're given!
ru: Игра разработана таким образом, чтобы позволить вам играть в ваши любимые настольные игры, фактически давая вам коробку с игрушками для игры (в которую входят такие вещи, как карты, кости, игровые детали и многое другое), и только от вас зависит, что вы будете делать с тем, что вам дано!

source: But the coolest thing about the game is that anyone can create assets for the game! It's as simple as dragging files into a folder and the game will import them, then you can use them straight away in-game! If you want to learn more about how to make assets for Tabletop Club, visit the :ref:`asset-packs` page.
ru: Но самое замечательное в игре то, что любой может создавать ассеты для игры! Просто перетащите файлы в папку, и игра импортирует их, после чего вы сможете сразу же использовать их в игре! Если вы хотите узнать больше о том, как создавать ассеты для Tabletop Club, посетите страницу ":ref:`asset-packs`".

source: Simulator
ru: Симулятор

source: Not only is the game a simulator of tabletop games, it also has a fully-simulated 3D physics engine! This means that objects in the game act like they do in real life, and it also means you can potentially send objects flying off the edge! Did I also mention you could flip the table?
ru: Игра не только является симулятором настольных игр, она также имеет полностью смоделированный 3D физический движок! Это означает, что объекты в игре ведут себя так же, как и в реальной жизни, а также то, что вы можете отправлять объекты в полет! Я также упоминал, что вы можете перевернуть стол?

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: What platforms can I play Tabletop Club on?
ru: На каких платформах я могу играть в Tabletop Club?

source: Tabletop Club can be played on any of these platforms:
ru: В Tabletop Club можно играть на любой из этих платформ:

source: Currently there are no plans for the game to be supported on mobile devices or consoles.
ru: В настоящее время нет планов по поддержке игры на мобильных устройствах или консолях.

source: Does Tabletop Club support multiplayer?
ru: Поддерживает ли Tabletop Club многопользовательскую игру?

source: Yes! You don't need to make an account to play multiplayer, you can just host a game and start playing with friends!
ru: Да! Для многопользовательской игры вам не нужно создавать учетную запись, вы можете просто захостить игру и начать играть с друзьями!

source: You can change your name and colour in multiplayer by going to :guilabel:`Options` > :guilabel:`Multiplayer`, and changing the relevant settings.
ru: Вы можете изменить свое имя и цвет в многопользовательской игре, зайдя в :guilabel:`Настройки` > :guilabel:`Многопользовательская игра` и изменив соответствующие настройки.

source: Is Tabletop Club on Steam / GOG / itch.io?
ru: Tabletop Club есть в Steam / GOG / itch.io?

source: What stage of development is Tabletop Club at?
ru: На какой стадии разработки находится Tabletop Club?

source: What board games can I play in Tabletop Club?
ru: В какие настольные игры я могу играть в Tabletop Club?

source: Theoretically, any of them!
ru: Теоретически, в любую!

source: Out of the box, the games comes with the default Tabletop Club asset pack which contains some of the most common objects you'll need, like playing cards, dice, poker chips, etc.
ru: Из коробки игра поставляется со стандартным набором ассетов Tabletop Club, который содержит некоторые из наиболее распространенных объектов, которые вам понадобятся, такие как игральные карты, кости, покерные фишки и т.д.

source: On the other hand, if the pieces you need aren't going to be included in the default asset pack, then you can either download an asset pack that someone else has already made, or you can create your own! Visit the :ref:`asset-packs` page if you're interested in making your own assets.
ru: С другой стороны, если нужные вам детали не входят в стандартный пакет ассетов, вы можете либо загрузить пакет ассетов, который уже был создан кем-то другим, либо создать свой собственный! Посетите страницу ":ref:`asset-packs`", если вы заинтересованы в создании собственных ассетов.

source: How easy is it to setup a game in Tabletop Club?
ru: Насколько легко настроить игру в Tabletop Club?

source: For the most popular games, the default asset pack comes with pre-made save files that you can load instantly (when in-game, click :guilabel:`Games`, then click on the game you want to play, then click :guilabel:`Load`) to play the game right away!
ru: Для самых популярных игр пакет ассетов по умолчанию поставляется с заранее созданными файлами сохранений, которые вы можете мгновенно загрузить (находясь в игре, нажмите :guilabel:`Игры`, затем нажмите на игру, в которую вы хотите играть, затем нажмите :guilabel:`Загрузить`), чтобы сразу же начать игру!

source: If there isn't a pre-made save file for the game you want to play, you can easily make your own save by setting up the table the way you want to, then by going to the menu and clicking :guilabel:`Save file`. This way, if you want to play the game again, you can just load the save you made previously.
ru: Если для игры, в которую вы хотите поиграть, нет готового файла сохранения, вы можете легко сделать собственное сохранение, настроив стол так, как вам нужно, затем зайдя в меню и выбрав :guilabel:`Сохранить файл`. Таким образом, если вы захотите сыграть в игру снова, вы сможете просто загрузить сохранение, которое вы сделали ранее.

source: See the :ref:`asset-type-game` page for more information about pre-made save files in asset packs.
ru: Дополнительную информацию о предустановленных файлах сохранения в пакетах ассетов см. на странице ":ref:`asset-type-game`".

source: Can I add assets other than game pieces to Tabletop Club?
ru: Могу ли я добавить в Tabletop Club другие ассеты, кроме игровых деталей?

source: Yes! As well as objects, you can also import the following types of assets:
ru: Да! Помимо объектов, вы можете импортировать следующие типы ассетов:

source: Can you add my favourite board game to Tabletop Club?
ru: Вы можете добавить мою любимую настольную игру в Tabletop Club?

source: For legal safety, Tabletop Club will only ever distribute `public-domain <https://en.wikipedia.org/wiki/Public_domain>`_ board games in the default asset pack. But that doesn't stop you from making assets for your favourite board game for private use!
ru: В целях юридической безопасности Tabletop Club будет распространять только `настольные игры в общественном достоянии <https://ru.wikipedia.org/wiki/Public_domain>`_ в пакете ассетов по умолчанию. Но это не остановит вас от создания ассетов для вашей любимой настольной игры для личного использования!

source: Can I share assets I've made on the internet?
ru: Могу ли я поделиться ассетами, которые я сделал, в интернете?

source: It depends on a number of factors. In general, it should be safe to share the assets you've made for the game if the following is all true:
ru: Это зависит от ряда факторов. В целом, можно смело делиться ассетами, которые вы создали для игры, если верно следующее:

source: The assets you've made (textures, 3D models, etc.) are made by you, and are not derived from copyrighted material.
ru: Созданные вами ассеты (текстуры, 3D-модели и т.д.) сделаны вами и не взяты из материалов, защищенных авторским правом.

source: You can distribute other people's creations **if** the license it's under allows you to. It's always safer to attribute the original author, and to state the license and whether the content was modified. Please read the terms of the license first.
ru: Вы можете распространять чужие творения, **если** лицензия, под которой они находятся, позволяет вам это делать. Всегда безопаснее указывать автора оригинала, а также лицензию и то, был ли изменен контент. Пожалуйста, сначала прочитайте условия лицензии.

source: To help with this, the :ref:`config-cfg` file allows you to put the author, license, modifier, and URL with the asset, which is then shown in-game.
ru: Чтобы помочь в этом, файл :ref:`config-cfg` позволяет вам поместить автора, лицензию, модификатор и URL-адрес с ассетом, который затем отображается в игре.

source: If the assets you've made are for playing a game that already exists, then:
ru: Если созданные вами ассеты предназначены для игры, которая уже существует, тогда:

source: You cannot use the same name of the game without the owner's explicit permission.
ru: Вы не можете использовать одно и то же имя игры без явного разрешения владельца.

source: The mechanics of the game cannot be patented.
ru: Механика игры не может быть запатентована.

source: This is NOT legal advice. Please go ask the nearest lawyer for advice if you are worried about distributing your asset pack on the internet, as this also depends on your country's copyright laws.
ru: Это НЕ юридическая консультация. Пожалуйста, обратитесь за советом к ближайшему юристу, если вы беспокоитесь о распространении вашего пакета ассетов в интернете, так как это также зависит от законов об авторском праве вашей страны.

source: Coding guidelines
ru: Рекомендации по написанию кода

source: When modifying the game's scenes and scripts, as well as following Godot's `GDScript style guide`_, make sure to follow these guidelines for consistency, and to make everyone's lives easier:
ru: При изменении сцен и скриптов игры, а также следуя Godot `руководству по стилю GDScript`_, обязательно следуйте этим рекомендациям для последовательности и облегчения жизни всем:

source: Only use GDScript for scripting.
ru: Для создания скриптов используйте только GDScript.

source: When writing code, make sure your editor (whether it's Godot, or another external editor) is set to use tabs instead of spaces.
ru: При написании кода убедитесь, что ваш редактор (будь то Godot или другой внешний редактор) настроен на использование табуляции вместо пробелов.

source: When creating a new script, use the ``Copyright Notice`` template in ``game/Scripts/Templates/CopyrightNotice.gd``.
ru: При создании нового скрипта используйте шаблон ``Copyright Notice`` в ``game/Scripts/Templates/CopyrightNotice.gd``.

source: Use typed variables, arguments, and return values where possible.
ru: По возможности используйте типизированные переменные, аргументы и возвращаемые значения.

source: When writing functions in scripts that aren't built in functions (e.g. ``_ready()``) or functions called by signals (e.g. ``_on_*``), then please add a comment above the function describing what the function does, what it's return value is (if any), and what the arguments are. For example:
ru: При написании функций в скриптах, которые не являются встроенными функциями (например, ``_ready()``) или функциями, вызываемыми сигналами (например. ``_on_*``), то, пожалуйста, добавьте комментарий над функцией, описывающий, что делает функция, каково ее возвращаемое значение (если оно есть), и каковы аргументы. Например:

source: Make sure to fix any warnings Godot shows in scripts.
ru: Убедитесь, что исправили все предупреждения, которые Godot показывает в скриптах.

source: If you are writing strings that will get displayed in the UI, remember to use the ``tr()`` function so the text can be translated.
ru: Если вы пишете строки, которые будут отображаться в пользовательском интерфейсе, не забудьте использовать функцию ``tr()``, чтобы текст мог быть переведен.

source: When creating new scenes, fill in the editor description for the root node explaining what the scene does. Also fill in the editor description for any nodes in the scene where it isn't obvious what they're there for.
ru: При создании новых сцен заполняйте описание редактора для корневого узла, объясняя, что делает сцена. Также заполните описание редактора для всех узлов сцены, где не очевидно, для чего они нужны.

source: Contributing
ru: Участие

source: If you want to help contribute to the project directly, by either fixing a bug or implementing a feature, then you'll need to create a **pull request** on the project's `GitHub repository`_. This page explains the steps needed to do exactly that!
ru: Если вы хотите помочь проекту напрямую, исправляя ошибки или внедряя функции, то вам нужно создать **pull request** в `репозитории проекта на GitHub`_. На этой странице описаны шаги, необходимые для того, чтобы сделать именно это!

source: Creating a fork
ru: Создание форка

source: To create a fork of the Tabletop Club repository on GitHub, you can go to the `GitHub repository`_ and click on the :guilabel:`Fork` button on the top-right. You should now have your own copy of the repository at that point in time. You can then clone the repository to your computer with ``git clone``.
ru: Чтобы создать форк репозитория Tabletop Club на GitHub, вы можете перейти в `репозиторий GitHub`_ и нажать на кнопку :guilabel:`Fork` в правом верхнем углу. Теперь у вас должна быть собственная копия репозитория. Затем вы можете клонировать репозиторий на свой компьютер с помощью ``git clone``.

source: In this cloned repository, ``origin`` will point to your forked repository, which will not automatically update with the original repository. To make sure you can get updates from the original repository, you can add the original as a remote repository with this command:
ru: В этом клонированном репозитории ``origin`` будет указывать на ваш форкнутый репозиторий, который не будет автоматически обновляться с оригинальным репозиторием. Чтобы убедиться, что вы сможете получать обновления из оригинального репозитория, вы можете добавить оригинал в качестве удаленного репозитория с помощью этой команды:

source: Now, if you ever need to update the ``master`` branch on your local repository, you can run the following commands:
ru: Теперь, если вам когда-нибудь понадобится обновить ветвь ``master`` в локальном репозитории, вы можете выполнить следующие команды:

source: You can then update your fork on GitHub with these changes:
ru: Затем вы можете обновить свой форк на GitHub со следующими изменениями:

source: Downloading and compiling Godot
ru: Загрузка и компиляция Godot

source: Now that you have made a local copy of the fork on your computer, there's one more step that's needed to be able to play, edit, and test the game - you'll need to download and compile the modified version of Godot the game runs on. You can follow the instructions in :ref:`compiling-from-source` up until the section where you download the game (you already did that just!) to get Godot up and running.
ru: Теперь, когда вы сделали локальную копию форка на своем компьютере, есть еще один шаг, который необходим, чтобы иметь возможность играть, редактировать и тестировать игру - вам необходимо скачать и скомпилировать модифицированную версию Godot, на которой работает игра. Вы можете следовать инструкциям на странице ":ref:`compiling-from-source`" до раздела, где вы скачиваете игру (вы уже сделали это!), чтобы запустить Godot.

source: Making changes
ru: Внесение изменений

source: Before you start making the changes you want to make, it is highly advised that you create a branch on the local repository for the bug/feature you're going to solve:
ru: Прежде чем приступить к внесению изменений, настоятельно рекомендуется создать ветку в локальном репозитории для ошибок/функций, которые вы собираетесь решить:

source: Now you can start working on the code! See :ref:`coding-guidelines` for guidelines as to how you should write your code.
ru: Теперь вы можете начать работу над кодом! Смотрите страницу ":ref:`coding-guidelines`" для рекомендаций о том, как вы должны писать свой код.

source: Creating a pull request
ru: Создание запроса на слияние

source: Once you've made the changes you wanted to make, and you've thoroughly tested them, you can push them to the custom branch on your forked repository and create a pull request!
ru: Как только вы внесли изменения, которые хотели сделать, и тщательно протестировали их, вы можете перенести их в пользовательскую ветку на вашем форкнутом репозитории и создать запрос на слияние!

source: To start, go to the original `GitHub repository`_ and click :guilabel:`Pull requests` > :guilabel:`New pull request`. Make sure you are merging from your fork's custom branch to ``drwhut/tabletop-club`` on the ``master`` branch. If GitHub is happy, then you can click :guilabel:`Create pull request`, and fill in the details for the pull request.
ru: Для начала перейдите в исходный репозиторий GitHub и нажмите :guilabel:'Pull requests' > :guilabel:'New pull request'. Убедитесь, что вы делаете слияние из пользовательской ветки вашего форка в ''drwhut/tabletop-club'' в ветку ''master''. Если GitHub доволен, вы можете нажать :guilabel:'Create pull request' и заполнить сведения о запросе на слияние.

source: If the pull request was to fix an issue, then please put the issue number in the pull request! For example, if the issue fixes issue number ``69``, then say in the pull request: ``This PR fixes #69``.
ru: Если запрос на слияние исправляет проблему, то, пожалуйста, укажите номер проблемы в запросе! Например, если запрос исправляет проблему номер ``69``, то укажите в запросе на слияние: ``This PR fixes #69``.

source: Once you're done filling in the PR, you can submit it!
ru: Как только вы закончите заполнять запрос на слияние, вы можете отправить его!

source: If we ask you to make changes to the pull request, you can do so by making the changes locally on your computer and pushing the commits to your fork's custom branch. These new commits will appear automatically in the PR.
ru: Если мы попросим вас внести изменения в запрос на слияние, вы можете сделать это, внеся изменения локально на своем компьютере и переместив коммиты в вашу пользовательскую ветку форка. Эти новые коммиты автоматически появятся в запросе на слияние.

source: Resolving merge conflicts
ru: Разрешение конфликтов слияния

source: There is a chance that GitHub will not let us merge the pull request into the ``master`` branch because of a merge conflict between the ``master`` branch and the branch on your fork. In this case, you should take the following steps:
ru: Существует вероятность того, что GitHub не позволит нам объединить запрос на слияние в ветку ``master`` из-за конфликта слияния между веткой ``master`` и веткой на вашем форке. В этом случае вам следует выполнить следующие действия:

source: Update the fork's ``master`` branch so it is up-to-date with the original's:
ru: Обновите ветку форка ``master``, чтобы она соответствовала оригинальной ветке:

source: Merge the ``master`` branch on your local repository into your custom branch:
ru: Объедините ветку ``master`` в локальном репозитории с вашей пользовательской веткой:

source: You can also use ``rebase`` here instead of ``merge``, but we don't mind whichever command you use. Use whichever one you're most comfortable with!
ru: Вы также можете использовать ``rebase`` здесь вместо ``merge``, но мы не против того, какую команду вы используете. Используйте ту, с которой вам удобнее!

source: At this point you'll get the same merge conflicts that stopped the pull request from being merged. You need to resolve them before continuing.
ru: На этом этапе вы получите те же конфликты слияния, которые помешали слиянию запроса на слияние. Вам нужно разрешить их, прежде чем продолжать.

source: Test that the changes you've made still work after the merge.
ru: Проверьте, работают ли внесенные вами изменения после слияния.

source: Push the merge commit, plus any other commits you make, to your fork.
ru: Отправьте коммит слияния, а также любые другие коммиты, которые вы делаете, в свой форк.

source: Go back to the pull request on GitHub, and ensure that there are no merge merge conflicts.
ru: Вернитесь к запросу на слияние на GitHub и убедитесь, что конфликтов слияния нет.

source: Ways to contribute
ru: Способы внести свой вклад

source: Reporting a bug
ru: Сообщить об ошибке

source: Before reporting a bug on GitHub, make sure of the following:
ru: Прежде чем сообщать об ошибке на GitHub, убедитесь в следующем:

source: The bug is reproducible. If you can't get the bug to happen again, then chances are that we won't be able to either, then we can't fix it!
ru: Ошибка воспроизводима. Если вы не можете заставить ошибку повториться, то есть шанс, что и мы не сможем, тогда мы не сможем ее исправить!

source: The bug hasn't already been reported - you can check by going to the `issues page`_ on GitHub and searching for it there.
ru: Об ошибке еще не сообщали - вы можете проверить это, перейдя на`страницу проблем`_ на GitHub и поискав ее там.

source: To report a bug, please `post an issue`_ on GitHub with the bug report template.
ru: Чтобы сообщить об ошибке, пожалуйста, `опубликуйте проблему`_ на GitHub с помощью шаблона сообщения об ошибке.

source: If you come across multiple bugs, please post one issue for each bug! This way, we can easily reference individual bugs.
ru: Если вы столкнулись с несколькими ошибками, пожалуйста, опубликуйте по одной проблеме для каждой ошибки! Таким образом, мы сможем легко ссылаться на отдельные ошибки.
