Repository: drwhut/tabletop-club
Catalog: docs/translations/*/LC_MESSAGES/general.po
Languages: ru

source: Copy the ``tabletop-club/assets/`` folder next to the exported binary, so the game has assets to import.
ru: Скопируйте папку ``tabletop-club/assets/`` рядом с экспортированным двоичным файлом, чтобы в игре были ассеты для импорта.

source: Now, you should be able to launch the exported executable and play the game directly!
ru: Теперь вы должны иметь возможность запустить экспортированный исполняемый файл и играть в игру напрямую!

source: Why did you fork Godot?
ru: Почему вы форкнули Godot?

source: There's actually just one reason for this: there was a feature that I knew existed in Godot, but it was not exposed to the in-built scripting language GDScript, and the functionality wasn't included in release templates.
ru: На самом деле для этого есть только одна причина: была функция, о существовании которой в Godot я знал, но она не была доступна для встроенного языка сценариев GDScript, и эта функциональность не была включена в шаблоны релизов.

source: When the game starts, the first thing it does is it scans certain folders for asset packs, and if it finds any, the game will then import assets from those packs. The way the game imports assets is almost identical to how Godot imports assets in the editor. It's possible because of `a custom module <https://github.com/drwhut/tabletop_club_godot_module>`_ I made that takes advantage of the importing code that already exists for the editor, and it allows me to import assets like textures and 3D models from anywhere on the filesystem using just one function in GDScript.
ru: Когда игра запускается, первое, что она делает, это сканирует определенные папки на наличие пакетов ассетов, и если она их находит, игра импортирует ассеты из этих пакетов. Способ импорта ассетов в игре почти идентичен тому, как Godot импортирует ассеты в редакторе. Это возможно благодаря `созданному мной модулю <https://github.com/drwhut/tabletop_club_godot_module>`_, который использует код импорта, уже существующий для редактора, и позволяет импортировать такие ассеты, как текстуры и 3D-модели, из любого места файловой системы с помощью всего одной функции в GDScript.

source: However, a problem occured when compiling Godot with this module as a release template - the compiled editor code was not included in the release templates, so the custom module had no idea what "importing" meant. This meant I had to tweak some of the editor code and the SCons build script to include the importing code in release builds, while stopping compiler/runtime errors from happening since the code was suddenly disconnected from the rest of the editor.
ru: Однако при компиляции Godot с этим модулем в качестве шаблона релиза возникла проблема - скомпилированный код редактора не был включен в шаблоны релиза, поэтому пользовательский модуль не знал, что означает "импортирование". Это означало, что мне пришлось подправить код редактора и скрипт сборки SCons, чтобы включить импортируемый код в релизные сборки, одновременно предотвращая ошибки компилятора/runtime, поскольку код был внезапно отключен от остальной части редактора.

source: Footnotes
ru: Сноски

source: `The Godot documentation <https://docs.godotengine.org>`_ is from Juan Linietsky, Ariel Manzur and the Godot community, and it is licensed under the `CC-BY 3.0 License <https://creativecommons.org/licenses/by/3.0/>`_.
ru: `Документация Godot <https://docs.godotengine.org>`_ предоставлена Хуаном Линецким, Ариэлем Манзуром и сообществом Godot и лицензирована по лицензии `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_.

source: Downloading the official binaries
ru: Загрузка официальных двоичных файлов

source: In most cases, you'll want to download the latest *non-beta* version of the game. While beta versions of the game have new features and are very helpful for player feedback, they are more suseptable to bugs. But if you're feeling a little experimental, go for the latest version!
ru: В большинстве случаев вы захотите загрузить последнюю *небета-версию игры*. Хотя бета-версии игры имеют новые функции и очень полезны для обратной связи с игроками, они более подвержены ошибкам. Но если вам хочется поэкспериментировать, выбирайте последнюю версию!

source: If you've downloaded Tabletop Club in the past and want to download a newer version, follow :ref:`upgrading-installation` before carrying on here.
ru: Если вы загрузили Tabletop Club в прошлом и хотите загрузить более новую версию, следуйте инструкциям на странице ":ref:`upgrading-installation`" перед тем, как продолжить здесь.

source: What happens now depends slightly on which platform you're on:
ru: Что произойдет теперь, зависит от того, на какой платформе вы находитесь:

source: Downloading for Windows
ru: Загрузка для Windows

source: Make sure you have downloaded the compressed file, it should be called something like ``TabletopClub_vX.X.X_Windows_64.zip``.
ru: Убедитесь, что вы скачали сжатый файл, он должен называться примерно так ``TabletopClub_vX.X.X_Windows_64.zip``.

source: Right-click the downloaded file in File Explorer, and click :guilabel:`Extract all...`
ru: Щелкните правой кнопкой мыши по загруженному файлу в Проводнике и нажмите :guilabel:`Извлечь все…`

source: There should be a pop-up asking where you want to extract the files to. You can put the game files anywhere you like, for example ``Desktop/TabletopClub``. You can then click :guilabel:`Extract` to extract the files to that location.
ru: Должно появиться всплывающее окно с вопросом, куда вы хотите извлечь файлы. Вы можете поместить файлы игры куда угодно, например ``Desktop/TabletopClub``. Затем вы можете нажать :guilabel:`Извлечь`, чтобы извлечь файлы в это место.

source: Go to the folder where you extracted the files, and double-click the ``TabletopClub.exe`` executable to start the game!
ru: Перейдите в папку, куда вы извлекли файлы, и дважды щелкните на исполняемом файле ``TabletopClub.exe``, чтобы запустить игру!

source: Currently Windows binaries of the game are not signed, so you'll most likely get a warning when you try to run the game saying that the publisher can't be trusted. You can get past this by clicking :guilabel:`More info`, then by clicking :guilabel:`Run anyway`.
ru: В настоящее время двоичные файлы игры для Windows не подписаны, поэтому вы скорее всего, получите предупреждение при попытке запустить игру о том, что издатель не может быть доверенным. Вы можете пропустить это, нажав :guilabel:`Дополнительная информация`, а затем нажав :guilabel:`В любом случае запустить`.

source: Downloading for macOS
ru: Загрузка для macOS

source: Start downloading the compressed file, it should be called something like ``TabletopClub_vX.X.X_OSX_Universal.zip``.
ru: Начните загрузку сжатого файла, он должен называться примерно так ``TabletopClub_vX.X.X_OSX_Universal.zip``.

source: Re-name the new folder to ``TabletopClub``.
ru: Переименуйте новую папку в ``TabletopClub``.

source: Go into the folder, and launch the game by right-clicking ``TabletopClub`` and clicking :guilabel:`Open`.
ru: Зайдите в папку и запустите игру, щелкнув правой кнопкой мыши ``TabletopClub`` и нажав :guilabel:`Открыть`.

source: Currently macOS binaries of the game are not signed, so you'll get a warning saying the publisher is unknown. You can get past this warning by clicking :guilabel:`Open` in the pop-up. This button won't appear if you double-click the application.
ru: В настоящее время двоичные файлы игры для macOS не подписаны, поэтому вы получите предупреждение о том, что издатель неизвестен. Вы можете пропустить это предупреждение, нажав кнопку :guilabel:`Открыть` во всплывающем окне. Эта кнопка не появится, если вы дважды щелкните приложение.

source: Downloading for Linux / \*BSD
ru: Загрузка для Linux / \*BSD

source: Either use your distribution's archive manager to extract the files, or run this command in a terminal:
ru: Либо используйте менеджер архивов вашего дистрибутива для извлечения файлов, либо выполните эту команду в терминале:

source: Either double-click the executable, or go into a terminal and run this command in the folder the executable is in:
ru: Либо дважды щелкните исполняемый файл, либо зайдите в терминал и выполните эту команду в папке, в которой находится исполняемый файл:

source: Upgrading an existing installation
ru: Обновление существующей установки

source: If you have already downloaded the game before, and you want to overwrite the files that are already there, then before downloading and extracting the new version of the game, first delete the following files and folders:
ru: Если вы уже скачивали игру ранее и хотите перезаписать уже имеющиеся файлы, то перед скачиванием и извлечением новой версии игры сначала удалите следующие файлы и папки:

source: ``TabletopClub.exe``, or ``TabletopClub.app``, or ``TabletopClub.x86_64``
ru: ``TabletopClub.exe``, или ``TabletopClub.app``, или ``TabletopClub.x86_64``

source: Now you can extract the new version of the game as described above. If the operating systems asks you if you want to replace any files, say yes to all files.
ru: Теперь вы можете извлечь новую версию игры, как описано выше. Если операционная система спросит вас, хотите ли вы заменить какие-либо файлы, ответьте "да" для всех файлов.

source: Download
ru: Загрузить

source: There are two ways to download and play Tabletop Club:
ru: Существует два способа загрузить и играть в Tabletop Club:

source: By downloading the official binary for your platform and running the executable. This is by far the simplest method, and it is all that most players need to do.
ru: Загрузив официальный двоичный файл для вашей платформы и запустив исполняемый файл. Это, безусловно, самый простой метод, и это все, что нужно сделать большинству игроков.

source: By downloading the source code from the game's repository and compiling it from scratch. This requires a few extra steps compared to running a pre-built binary, but you'll need to do this if you plan on contributing to the game code, or you could try it for fun!
ru: Загрузив исходный код из репозитория игры и скомпилировав его с нуля. Это требует нескольких дополнительных шагов по сравнению с запуском предварительно собранного двоичного файла, но вам придется сделать это, если вы планируете внести свой вклад в код игры, или вы можете попробовать это для развлечения!
